README.org
#+TITLE:     Shell configuration files
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+Time-stamp: <2014-10-21 Tue 10:44>
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   ^:{}

#+PROPERTY:  eval no
#+SETUPFILE: bigblow-pirilampo.setup

* Documentation

[[http://www.bash2zsh.com/zsh_refcard/refcard.pdf][Zsh Reference Card]]

* Startup files

There are three *sorts of shells*:

- (interactive) *login* (for which =c:/cygwin/etc/profile= and =.profile= are read,
  which sources =.bashrc= as well)

  *Note --* Launching Cygwin Terminal (login shell) does not load ~.bashrc~ on its
  own, it only loads ~.bash_profile~. Hence, the need to have a ~.bash_profile~
  sourcing ~.bashrc~...

- *interactive* (non-login) (for which =.bashrc= is read)

- normal shell, i.e. one that's running a *script* (bash does not execute any
  initialization file in this case!)

  =$tty= is empty.

We just let =.profile= also read =.bashrc= and put everything in =.bashrc=.

*Read* [[http://shreevatsa.wordpress.com/2008/03/30/zshbash-startup-files-loading-order-bashrc-zshrc-etc/][Zsh/Bash startup files loading order]]:

- For bash, put stuff in =~/.bashrc=, and make =~/.bash_profile= source it.
- For zsh, put stuff in =~/.zshrc=, which is always executed.

To recover the default bash configuration files, get their copy from
=/etc/skel=.

If you get a couple of "command not found" errors and a corrupt prompt at
startup, then your =.bashrc= is probably in Windows text format (~\r\n~ line
endings).  Make sure your editor is in Unix format when creating text files.

** What to put where?

Login shell runs .profile (or .bash_profile or .bash_login) on startup. Set
your env variables in there, cuz sub-shells will inherit the env vars. Then
make .profile run your .bashrc:

#+begin_src sh
. .bashrc
#+end_src

Interactive runs .bashrc. Since it inherits envs, but not aliases, put your
aliases in this file.

Shell scripts, cron jobs, and the like, run with a bare shell: no bashrc or
profiles are run. No kidding you get 4 env vars set, the bare
minimum. Therefore your PATH won't work very well so you often have to give an
abs pathname like in crontab:

#+begin_src sh
right: 0 0 * * 2 /usr/sbin/apachectl restart
wrong: 0 0 * * 2 apachectl restart
#+end_src

From https://www.linuxquestions.org/questions/linux-general-1/difference-between-normal-shell-and-login-shell-14983/#post4828786

** Note

In ~c:/cygwin/etc/profile~,

- ~/usr/local/bin~ is appended to the =PATH=!!

  And, except when root, it is almost always wrong to have ~/usr/local/bin~ after
  any system path.

- =TZ= (time zone) is set... which gives wrong times (1 hour difference) in Emacs
  when called from ~c:/cygwin/Cygwin.bat~!!

* Terminals

- =dumb=
- =cygwin=
- =emacs=
- =screen=
- =xterm=
- =xterm-256color= (choose this if Emacs looks ugly in a terminal)
- =eterm-color=

* Bash specific
  :PROPERTIES:
  :tangle:   ./src/.bashrc
  :END:

Le =!= en shell permet plein de trucs sympa.

- =!!= refait la dernière commande
- =!cmd= refait la dernière commande commençant par =cmd=
- =!cmd:p= permet de visualiser sans éxecuter la dernière commande commençant
  par =cmd=
- =!$= est le dernier mot du ligne de commande précédent
- =!cmd:$= est le dernier mot du dernier ligne de commande commençant par =cmd=
- =!*= est l'ensemble de la dernière ligne de commande à part le premier mot

Pourquoi ce dernier est-il utile ?  Pense à ceci :

#+begin_src sh :tangle no
$ gm convret -size 120x120 input.png -resize 120x120 -draw "gravity southeast text 0,0 'Dave Neary'" output.jpg
bash: convret: command not found
$ gm convert !*
#+end_src

** Profile

#+begin_src sh :tangle ./src/.bash_profile
# User dependent .bash_profile file

# source the user's .bashrc if it exists
if [ -f "${HOME}/.bashrc" ] ; then
  source "${HOME}/.bashrc"
fi
#+end_src

