README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta name="generator" content="HTML Tidy for Cygwin (vers 1st September 2004), see www.w3.org" />
<title>Shell configuration files</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="generator" content="Org-mode" />
<meta name="author" content="Fabrice Niessen" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css" />







</head>
<body>
<div id="content">
<h1 class="title">Shell configuration files</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Documentation</a></li>
<li><a href="#orgheadline4">2. Startup files</a>
<ul>
<li><a href="#orgheadline2">2.1. What to put where?</a></li>
<li><a href="#orgheadline3">2.2. Note</a></li>
</ul>
</li>
<li><a href="#orgheadline5">3. Terminals</a></li>
<li><a href="#orgheadline19">4. Bash specific</a>
<ul>
<li><a href="#orgheadline6">4.1. Profile</a></li>
<li><a href="#orgheadline7">4.2. Preamble</a></li>
<li><a href="#orgheadline13">4.3. Variables</a>
<ul>
<li><a href="#orgheadline8">4.3.1. Search path</a></li>
<li><a href="#orgheadline9">4.3.2. Prompt</a></li>
<li><a href="#orgheadline10">4.3.3. Command history</a></li>
<li><a href="#orgheadline11">4.3.4. Term</a></li>
<li><a href="#orgheadline12">4.3.5. Display</a></li>
</ul>
</li>
<li><a href="#orgheadline14">4.4. Code</a></li>
<li><a href="#orgheadline15">4.5. Next</a></li>
<li><a href="#orgheadline16">4.6. Source common files</a></li>
<li><a href="#orgheadline17">4.7. Next</a></li>
<li><a href="#orgheadline18">4.8. Postamble</a></li>
</ul>
</li>
<li><a href="#orgheadline37">5. Zsh specific</a>
<ul>
<li><a href="#orgheadline20">5.1. Examples</a></li>
<li><a href="#orgheadline21">5.2. Preamble</a></li>
<li><a href="#orgheadline27">5.3. Variables</a>
<ul>
<li><a href="#orgheadline22">5.3.1. Search path</a></li>
<li><a href="#orgheadline23">5.3.2. Prompt</a></li>
<li><a href="#orgheadline24">5.3.3. Command history</a></li>
<li><a href="#orgheadline25">5.3.4. Term</a></li>
<li><a href="#orgheadline26">5.3.5. Display</a></li>
</ul>
</li>
<li><a href="#orgheadline28">5.4. Aliasing</a></li>
<li><a href="#orgheadline29">5.5. Ledger</a></li>
<li><a href="#orgheadline30">5.6. Functions</a></li>
<li><a href="#orgheadline31">5.7. Source common files</a></li>
<li><a href="#orgheadline32">5.8. Line Editor</a></li>
<li><a href="#orgheadline33">5.9. Completion Widgets</a></li>
<li><a href="#orgheadline34">5.10. Completion System</a></li>
<li><a href="#orgheadline35">5.11. Zsh Modules</a></li>
<li><a href="#orgheadline36">5.12. Others</a></li>
</ul>
</li>
<li><a href="#orgheadline51">6. Common</a>
<ul>
<li><a href="#orgheadline38">6.1. Preamble</a></li>
<li><a href="#orgheadline39">6.2. Default editor</a></li>
<li><a href="#orgheadline40">6.3. Aliases</a></li>
<li><a href="#orgheadline41">6.4. Emacs / Org</a></li>
<li><a href="#orgheadline42">6.5. Grep</a></li>
<li><a href="#orgheadline43">6.6. Pager</a></li>
<li><a href="#orgheadline44">6.7. GraphicsMagick</a></li>
<li><a href="#orgheadline45">6.8. MCit tools</a></li>
<li><a href="#orgheadline46">6.9. Next</a></li>
<li><a href="#orgheadline47">6.10. Functions</a></li>
<li><a href="#orgheadline48">6.11. Emacsclient</a></li>
<li><a href="#orgheadline49">6.12. Other</a></li>
<li><a href="#orgheadline50">6.13. Postamble</a></li>
</ul>
</li>
<li><a href="#orgheadline52">7. InputRC</a></li>
<li><a href="#orgheadline53">8. Install environment</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Documentation</h2>
<div class="outline-text-2" id="text-1">
<p><a href="http://www.bash2zsh.com/zsh_refcard/refcard.pdf">Zsh Reference Card</a></p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Startup files</h2>
<div class="outline-text-2" id="text-2">
<p>There are three <b>sorts of shells</b>:</p>
<ul class="org-ul">
<li>
<p>(interactive) <b>login</b> (for which <code>c:/cygwin/etc/profile</code> and <code>.profile</code> are read, which sources <code>.bashrc</code> as well)</p>
<p><b>Note --</b> Launching Cygwin Terminal (login shell) does not load <code>.bashrc</code> on its own, it only loads <code>.bash_profile</code>. Hence, the need to have a <code>.bash_profile</code> sourcing <code>.bashrc</code>…</p>
</li>
<li><b>interactive</b> (non-login) (for which <code>.bashrc</code> is read)</li>
<li>
<p>normal shell, i.e. one that's running a <b>script</b> (bash does not execute any initialization file in this case!)</p>
<p><code>$tty</code> is empty.</p>
</li>
</ul>
<p>We just let <code>.profile</code> also read <code>.bashrc</code> and put everything in <code>.bashrc</code>.</p>
<p><b>Read</b> <a href="http://shreevatsa.wordpress.com/2008/03/30/zshbash-startup-files-loading-order-bashrc-zshrc-etc/">Zsh/Bash startup files loading order</a>:</p>
<ul class="org-ul">
<li>For bash, put stuff in <code>~/.bashrc</code>, and make <code>~/.bash_profile</code> source it.</li>
<li>For zsh, put stuff in <code>~/.zshrc</code>, which is always executed.</li>
</ul>
<p>To recover the default bash configuration files, get their copy from <code>/etc/skel</code>.</p>
<p>If you get a couple of "command not found" errors and a corrupt prompt at startup, then your <code>.bashrc</code> is probably in Windows text format (<code>\r\n</code> line endings). Make sure your editor is in Unix format when creating text files.</p>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> What to put where?</h3>
<div class="outline-text-3" id="text-2-1">
<p>Login shell runs .profile (or .bash_profile or .bash_login) on startup. Set your env variables in there, cuz sub-shells will inherit the env vars. Then make .profile run your .bashrc:</p>
<div class="org-src-container">
<pre class="src src-shell">
. .bashrc
</pre></div>
<p>Interactive runs .bashrc. Since it inherits envs, but not aliases, put your aliases in this file.</p>
<p>Shell scripts, cron jobs, and the like, run with a bare shell: no bashrc or profiles are run. No kidding you get 4 env vars set, the bare minimum. Therefore your PATH won't work very well so you often have to give an abs pathname like in crontab:</p>
<div class="org-src-container">
<pre class="src src-shell">
right: 0 0 * * 2 /usr/sbin/apachectl restart
wrong: 0 0 * * 2 apachectl restart
</pre></div>
<p>From <a href="https://www.linuxquestions.org/questions/linux-general-1/difference-between-normal-shell-and-login-shell-14983/#post4828786">https://www.linuxquestions.org/questions/linux-general-1/difference-between-normal-shell-and-login-shell-14983/#post4828786</a></p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> Note</h3>
<div class="outline-text-3" id="text-2-2">
<p>In <code>c:/cygwin/etc/profile</code>,</p>
<ul class="org-ul">
<li>
<p><code>/usr/local/bin</code> is appended to the <code>PATH</code>!!</p>
<p>And, except when root, it is almost always wrong to have <code>/usr/local/bin</code> after any system path.</p>
</li>
<li><code>TZ</code> (time zone) is set… which gives wrong times (1 hour difference) in Emacs when called from <code>c:/cygwin/Cygwin.bat</code>!!</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Terminals</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>dumb</code></li>
<li><code>cygwin</code></li>
<li><code>emacs</code></li>
<li><code>screen</code></li>
<li><code>xterm</code></li>
<li><code>xterm-256color</code> (choose this if Emacs looks ugly in a terminal)</li>
<li><code>eterm-color</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">4</span> Bash specific</h2>
<div class="outline-text-2" id="text-4">
<p>Le <code>!</code> en shell permet plein de trucs sympa.</p>
<ul class="org-ul">
<li><code>!!</code> refait la dernière commande</li>
<li><code>!cmd</code> refait la dernière commande commençant par <code>cmd</code></li>
<li><code>!cmd:p</code> permet de visualiser sans éxecuter la dernière commande commençant par <code>cmd</code></li>
<li><code>!$</code> est le dernier mot du ligne de commande précédent</li>
<li><code>!cmd:$</code> est le dernier mot du dernier ligne de commande commençant par <code>cmd</code></li>
<li><code>!*</code> est l'ensemble de la dernière ligne de commande à part le premier mot</li>
</ul>
<p>Pourquoi ce dernier est-il utile ? Pense à ceci :</p>
<div class="org-src-container">
<pre class="src src-shell">
$ gm convret -size 120x120 input.png -resize 120x120 -draw <span class="org-string">"gravity southeast text 0,0 'Dave Neary'"</span> output.jpg
bash: convret: command not found
$ gm convert !*
</pre></div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">4.1</span> Profile</h3>
<div class="outline-text-3 org-src-container" id="text-4-1">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">User dependent .bash_profile file</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">source the user's .bashrc if it exists</span>
<span class="org-keyword">if</span> [ -f <span class="org-string">"${HOME}/.bashrc"</span> ] ; <span class="org-keyword">then</span>
  <span class="org-builtin">source</span> <span class="org-string">"${HOME}/.bashrc"</span>
<span class="org-keyword">fi</span>
</pre></div>
</div>
