README.html
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">4.3.2</span> Prompt</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>Appearance of the prompt.</p>
<p>Note <code>\[...\]</code> used by the shell to count proper length.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">*** Controlling the Prompt</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">regular colors</span>
<span class="org-variable-name">green</span>=<span class="org-string">"\[\e[0;32m\]"</span>
<span class="org-variable-name">yellow</span>=<span class="org-string">"\[\e[0;33m\]"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">bold colors</span>
<span class="org-variable-name">BLACK</span>=<span class="org-string">"\[\e[1;30m\]"</span>
<span class="org-variable-name">RED</span>=<span class="org-string">"\[\e[1;31m\]"</span>
<span class="org-variable-name">GREEN</span>=<span class="org-string">"\[\e[1;32m\]"</span>

<span class="org-variable-name">reset</span>=<span class="org-string">"\[\e[0m\]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">**** PS1 --- Default interaction prompt</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">**** PS2 --- Continuation interactive prompt</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">**** PS3 --- Prompt used by "select" inside shell script</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">**** PS4 --- Used by "set -x" to prefix tracing output</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">get line numbers when you run with `-x'</span>
<span class="org-variable-name">PS4</span>=<span class="org-string">'+'</span>${<span class="org-variable-name">green</span>}<span class="org-string">'[$0:${LINENO}]+ '</span>${<span class="org-variable-name">reset</span>}
<span class="org-comment-delimiter"># </span><span class="org-comment">single quotes (otherwise, this line number is taken)</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">If you are looking at performance issues, put `$SECONDS' in the PS4 prompt</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">as well</span>
</pre></div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">**** PROMPT_COMMAND</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">to be called just before the prompt is printed</span>
<span class="org-function-name">precmd</span> ()
{
    <span class="org-variable-name">RET</span>=$<span class="org-variable-name">?</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">set a color prompt (unless in Emacs)</span>
    <span class="org-keyword">case</span> $<span class="org-variable-name">TERM</span><span class="org-keyword"> in</span>
        cygwin|xterm*|rxvt-unicode)
            <span class="org-builtin">local</span> <span class="org-variable-name">color_prompt</span>=yes
            ;;
        dumb)
            <span class="org-comment-delimiter"># </span><span class="org-comment">`M-x shell' under Cygwin Emacs</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">`M-x eshell' under EmacsW32</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">Tramp</span>
            <span class="org-builtin">local</span> <span class="org-variable-name">color_prompt</span>=no
            ;;
        emacs)
            <span class="org-comment-delimiter"># </span><span class="org-comment">`M-x shell' under EmacsW32</span>
            <span class="org-builtin">local</span> <span class="org-variable-name">color_prompt</span>=no
            ;;
        eterm-color)
            <span class="org-comment-delimiter"># </span><span class="org-comment">`M-x term' under Cygwin Emacs</span>
            <span class="org-builtin">local</span> <span class="org-variable-name">color_prompt</span>=no
            ;;
    <span class="org-keyword">esac</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">colorful prompt, based on whether the previous command succeeded or not</span>
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">RET</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">HILIT_RET</span>=${<span class="org-variable-name">GREEN</span>}
    <span class="org-keyword">else</span>
        <span class="org-variable-name">HILIT_RET</span>=${<span class="org-variable-name">RED</span>}
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">replace the `$HOME' prefix by `~' in the current directory</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"$HOME"</span> = <span class="org-string">"${PWD:0:${#HOME}}"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">myPWD</span>=<span class="org-string">"~${PWD:${#HOME}}"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">myPWD</span>=$<span class="org-variable-name">PWD</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">how many characters of the path should be kept</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">pwd_max_length</span>=15

    <span class="org-keyword">if</span> [ ${#<span class="org-variable-name">myPWD</span>} -gt $<span class="org-variable-name">pwd_max_length</span> ]; <span class="org-keyword">then</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">pwd_offset</span>=$(( ${#<span class="org-variable-name">myPWD</span>} - $<span class="org-variable-name">pwd_max_length</span> ))
        <span class="org-variable-name">myPWD</span>=<span class="org-string">"...${myPWD:$pwd_offset:$pwd_max_length}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">prompt character</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"$USERNAME"</span> = <span class="org-string">"root"</span> ]; <span class="org-keyword">then</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">PROMPTCHAR</span>=<span class="org-string">"#"</span>
    <span class="org-keyword">else</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">PROMPTCHAR</span>=<span class="org-string">"$"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> [ <span class="org-string">"$color_prompt"</span> = <span class="org-string">"yes"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">PS1</span>=<span class="org-string">"${green}\u@\h${BLACK}:${yellow}${myPWD}${HILIT_RET} ${RET}${reset}${PROMPTCHAR} "</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">PS1</span>=<span class="org-string">"\u@\h:${myPWD} ${RET}${PROMPTCHAR} "</span>
    <span class="org-keyword">fi</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">execute the content of the `PROMPT_COMMAND' just before displaying the `PS1'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">variable (but don't confuse Tramp)</span>
[ $<span class="org-variable-name">TERM</span> = <span class="org-string">"dumb"</span> ] || <span class="org-variable-name">PROMPT_COMMAND</span>=precmd
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">4.3.3</span> Command history</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>Access and modify commands that you had previously typed at the command line.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">history</span>
<span class="org-variable-name">HISTFILE</span>=$<span class="org-variable-name">HOME</span>/.bash_history <span class="org-comment-delimiter"># </span><span class="org-comment">if paranoiac, `/dev/null'</span>
<span class="org-variable-name">HISTSIZE</span>=1000
<span class="org-variable-name">HISTFILESIZE</span>=1000
<span class="org-variable-name">HISTIGNORE</span>=<span class="org-string">"&amp;:[bf]g:exit"</span>
<span class="org-variable-name">HISTCONTROL</span>=ignoredups
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">4.3.4</span> Term</h4>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">4.3.5</span> Display</h4>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">4.4</span> Code</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** Source global rc file (if any)</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">source global definitions if the session is interactive (to avoid problems</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">like "stdin: is not a tty" when ssh'ing to a remote machine)</span>
<span class="org-keyword">if</span> ([ $(expr index <span class="org-string">"$-"</span> i) -ne 0 ] &amp;&amp; [ -f /etc/bashrc ]); <span class="org-keyword">then</span>
    . /etc/bashrc
<span class="org-keyword">fi</span>
</pre></div>
<p>A common cause is <code>mesg y</code> in <code>/etc/bashrc</code> on the remote machine, hence the user has to try avoiding sourcing it (on the <b>remote</b> machine) in non-interactive sessions.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** Default permissions</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">permissions on newly created files</span>
<span class="org-builtin">umask</span> 022 <span class="org-comment-delimiter"># </span><span class="org-comment">prevent new dirs and files from being group and world writable</span>

<span class="org-keyword">if</span> [ <span class="org-string">"$USERNAME"</span> = <span class="org-string">"root"</span> ]; <span class="org-keyword">then</span>
    <span class="org-builtin">umask</span> 077  <span class="org-comment-delimiter"># </span><span class="org-comment">stricter</span>
<span class="org-keyword">fi</span>
</pre></div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** Shell options</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">correct minor misspellings of cd pathnames</span>
shopt -s cdspell
</pre></div>
</div>
</div>
