README.org
** Next

#+begin_src sh
#** 5 (info "(bashref)Shell Variables")

# set MANPATH so it includes user's private man if it exists
# do the same with MANPATH
#if [ -d $HOME/man ]; then
#    MANPATH=$HOME/man:"${MANPATH}"
#    export MANPATH
#fi

# LANG="en_US.utf8"
# LC_CTYPE="en_US.utf8"
# LC_ALL="C"   # fixes the problem of strange characters in the man page
# XXX These should be set in `/etc/default/locale', via `sudo update-locale'

# XXX Set DISPLAY?

# colon separated list of directories to search for manual pages
#ifnset MANPATH "/usr/man"
    # TODO don't define it like that: does not work under Ubuntu!
    # See `/etc/manpath.config'

# Info readers (standalone + Emacs Info mode)
INFOPATH="/usr/share/info:$INFOPATH"
# include a trailing colon on `INFOPATH' to concatenate the Emacs
# `Info-default-directory-list' when searching for info files
INFOPATH="$HOME/src/emacs-w3m/doc:$INFOPATH"
INFOPATH="$HOME/src/gnus/texi:$INFOPATH"
INFOPATH="$HOME/Downloads/emacs/site-lisp/auctex-11.86/doc:$INFOPATH"
# INFOPATH="$HOME/texlive/2010/texmf/doc/info:$INFOPATH"
INFOPATH="$HOME/Public/Repositories/org-mode/doc:$INFOPATH"
#+end_src

#+begin_src sh :tangle no
# Functions to help us manage environment variables

# setenv [VAR] [value] - set environment variable
setenv () { eval $1="\$2" export $1; }

# unsetenv [VAR] - unset environment variable
unsetenv () { unset "$@"; }

# ifnset [VAR] [value] - set environment variable only if not set yet
ifnset () { eval $1=\${$1-"\$2"} export $1; }

# ifnull [VAR] [value] - set environment variable if not set yet or if NULL
ifnull () { eval $1=\${$1:-"\$2"} export $1; }

# append [VAR] [path] - append path separated by `:'
append () { eval $1=\${$1:+\$$1${2:+:}}\$2 export $1; }

# prepend [VAR] [path] - prepend path separated by `:'
prepend () { eval $1=\$2\${$1:+${2:+:}\$$1} export $1; }

# showvalue [VAR]... - print out the value of variables given their name
showvalue () { for i in $*; do eval echo "$i = \\\`\$$i\'"; done; }
#+end_src

** Source common files

~.commonshrc~ contains miscellaneous definitions common to Bash and Zsh.

An *alias* is a simple string substitution.

By default, it is *not expanded in non-interactive shells* (scripts, and even
functions called in an interactive shell!).

In general, it should not do more than *change the default options of a command*.

#+begin_src sh
#** 4.2 or 6.6 Aliases

# source common definitions
if [ -r "$HOME/.commonshrc" ]; then
    . $HOME/.commonshrc
fi
#+end_src

