README.html
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">4.5</span> Next</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 5 (info "(bashref)Shell Variables")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">set MANPATH so it includes user's private man if it exists</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">do the same with MANPATH</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">if [ -d $HOME/man ]; then</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">MANPATH=$HOME/man:"${MANPATH}"</span>
<span class="org-comment-delimiter">#    </span><span class="org-comment">export MANPATH</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">LANG="en_US.utf8"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">LC_CTYPE="en_US.utf8"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">LC_ALL="C"   # fixes the problem of strange characters in the man page</span>
<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">XXX</span></span><span class="org-comment"> These should be set in `/etc/default/locale', via `sudo update-locale'</span>

<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">XXX</span></span><span class="org-comment"> Set DISPLAY?</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">colon separated list of directories to search for manual pages</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">ifnset MANPATH "/usr/man"</span>
    <span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">TODO</span></span><span class="org-comment"> don't define it like that: does not work under Ubuntu!</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">See `/etc/manpath.config'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Info readers (standalone + Emacs Info mode)</span>
<span class="org-variable-name">INFOPATH</span>=<span class="org-string">"/usr/share/info:$INFOPATH"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">include a trailing colon on `INFOPATH' to concatenate the Emacs</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">`Info-default-directory-list' when searching for info files</span>
<span class="org-variable-name">INFOPATH</span>=<span class="org-string">"$HOME/src/emacs-w3m/doc:$INFOPATH"</span>
<span class="org-variable-name">INFOPATH</span>=<span class="org-string">"$HOME/src/gnus/texi:$INFOPATH"</span>
<span class="org-variable-name">INFOPATH</span>=<span class="org-string">"$HOME/Downloads/emacs/site-lisp/auctex-11.86/doc:$INFOPATH"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">INFOPATH="$HOME/texlive/2014/texmf/doc/info:$INFOPATH"</span>
<span class="org-variable-name">INFOPATH</span>=<span class="org-string">"$HOME/Public/Repositories/org-mode/doc:$INFOPATH"</span>
</pre></div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">Functions to help us manage environment variables</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">setenv [VAR] [value] - set environment variable</span>
<span class="org-function-name">setenv</span> () { <span class="org-builtin">eval</span> $<span class="org-variable-name">1</span>=<span class="org-string">"\$2"</span> export $<span class="org-variable-name">1</span>; }

<span class="org-comment-delimiter"># </span><span class="org-comment">unsetenv [VAR] - unset environment variable</span>
<span class="org-function-name">unsetenv</span> () { <span class="org-builtin">unset</span> <span class="org-string">"$@"</span>; }

<span class="org-comment-delimiter"># </span><span class="org-comment">ifnset [VAR] [value] - set environment variable only if not set yet</span>
<span class="org-function-name">ifnset</span> () { <span class="org-builtin">eval</span> $<span class="org-variable-name">1</span>=<span class="org-string">\$</span>{<span class="org-variable-name">$</span>1-<span class="org-string">"\$2"</span>} <span class="org-builtin">export</span> $<span class="org-variable-name">1</span>; }

<span class="org-comment-delimiter"># </span><span class="org-comment">ifnull [VAR] [value] - set environment variable if not set yet or if NULL</span>
<span class="org-function-name">ifnull</span> () { <span class="org-builtin">eval</span> $<span class="org-variable-name">1</span>=<span class="org-string">\$</span>{<span class="org-variable-name">$</span>1:-<span class="org-string">"\$2"</span>} <span class="org-builtin">export</span> $<span class="org-variable-name">1</span>; }

<span class="org-comment-delimiter"># </span><span class="org-comment">append [VAR] [path] - append path separated by `:'</span>
<span class="org-function-name">append</span> () { <span class="org-builtin">eval</span> $<span class="org-variable-name">1</span>=<span class="org-string">\$</span>{<span class="org-variable-name">$</span>1:+<span class="org-string">\$</span><span class="org-variable-name">$</span>1${<span class="org-variable-name">2</span>:+:}}<span class="org-string">\$</span><span class="org-variable-name">2</span> export $<span class="org-variable-name">1</span>; }

<span class="org-comment-delimiter"># </span><span class="org-comment">prepend [VAR] [path] - prepend path separated by `:'</span>
<span class="org-function-name">prepend</span> () { <span class="org-builtin">eval</span> $<span class="org-variable-name">1</span>=<span class="org-string">\$</span><span class="org-variable-name">2</span><span class="org-string">\$</span>{<span class="org-variable-name">$</span>1:+${<span class="org-variable-name">2</span>:+:}<span class="org-string">\$</span><span class="org-variable-name">$</span>1} <span class="org-builtin">export</span> $<span class="org-variable-name">1</span>; }

<span class="org-comment-delimiter"># </span><span class="org-comment">showvalue [VAR]... - print out the value of variables given their name</span>
<span class="org-function-name">showvalue</span> () { <span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $<span class="org-variable-name">*</span>; <span class="org-keyword">do </span><span class="org-builtin">eval</span> echo <span class="org-string">"$i = \\\`\$$i\'"</span>; <span class="org-keyword">done</span>; }
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">4.6</span> Source common files</h3>
<div class="outline-text-3" id="text-4-6">
<p><code>.commonshrc</code> contains miscellaneous definitions common to Bash and Zsh.</p>
<p>An <b>alias</b> is a simple string substitution.</p>
<p>By default, it is <b>not expanded in non-interactive shells</b> (scripts, and even functions called in an interactive shell!).</p>
<p>In general, it should not do more than <b>change the default options of a command</b>.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 4.2 or 6.6 Aliases</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">source common definitions</span>
<span class="org-keyword">if</span> [ -r <span class="org-string">"$HOME/.commonshrc"</span> ]; <span class="org-keyword">then</span>
    . $<span class="org-variable-name">HOME</span>/.commonshrc
<span class="org-keyword">fi</span>
</pre></div>
</div>
</div>
