README.org
** Next

#+begin_src sh
# ALTER the ORIGINAL meaning of existing commands (that scripts don't
# expect to see modified!)
alias df='df -kTh'
alias du='du -kh'
alias cp='cp -i'   # confirm copy over an existing file
alias mv='mv -i'   # confirm move over an existing file
alias rm='rm -i'   # confirm removing file (prevent some accidental mistakes)
alias ssh="ssh -C"
alias more="less"

alias rmdir="rm -fr"

# path
alias where='type -all'

# start up Windows applications associated with a particular file extension
# directly from the Bash prompt
alias start="cmd /c start"
alias start="cygstart" # under Cygwin

alias lo="locate -i" # case insensitive search
alias lg="locate -r '.*' | grep -i"

alias mkall="./configure && make && sudo make install"

alias tvm="tail -f /var/log/messages"

# sudo'ers
alias root="su - root"

# force the radio to always sync at 2 Mbps, even if other speeds are available
alias iwconfigslow="sudo iwconfig eth1 rate 2M"

# shortcuts
alias c="clear"
alias E="env | sort"
alias h="history 25"
alias j="jobs -l"
alias m=$PAGER
alias p=$PAGER
alias se="sudoedit"
alias X="ssh-agent startx &"
alias z="suspend"

# misc commands
alias dos2unix="sed s/
//g"
alias unix2dos="sed s/\$/
/"

alias hgrep="history | grep"

alias keyon="ssh-add -t 10800"  # add identity
alias keyoff="ssh-add -D"       # remove all identities
alias keylist="ssh-add -l"      # list all identities

alias kill9="kill -9"

# make an extract function!
alias tgz="tar -zxvf"
alias tbz2="tar -jxvf"

alias nfiles="find . -type f | wc -l"

alias ports="netstat -alpe --ip"

# most used programs
alias web="firefox &"
# alias scan="nmap -sS -O"
alias nm="nmap -sS -O -PI -PT"
alias portscan="nmap -sT -PT -R "

# anonymous wget (using Privoxy and Tor)
alias aget='wget --execute "http_proxy = http://127.0.0.1:8118" --proxy'
alias mirror="wget -v --tries=0 --continue --force-directories --mirror --no-parent"

# ngrep -i -w 'user|pass' port 110
# ngrep -d eth0 -i 'USER|PASS' tcp port 80
# ngrep google port 80
# ngrep -i 'rcpt to|mail from' tcp port smtp
# ngrep -q -t -wi "login" port 23


#** 8.6 Programmable Completion

complete -A helptopic help
complete -A hostname ssh telnet nmap rlogin ftp ping host traceroute nslookup rexec


#** Misc functions

saneperms ()
{
    find . -type d -print0 | xargs -0 chmod 755
    find . -type f -print0 | xargs -0 chmod ${1:=644}
}


# # search for various types or README file in dir and display them in $PAGER
# readme ()
# {
#     local files
#     files=(./(#i)*(read*me|lue*m(in|)ut)*(ND))
#     if (($#files)); then
#         $PAGER $files
#     else
#         print 'No README files.'
#     fi
# }

# # Get a file's basename, dirname, extension, etc
#
# # get extension; everything after last '.'
# ext=${file##*.}
#
# # basename
# basename=`basename "$file"`
# # everything after last '/'
# basename=${file##*/}
#
# # dirname
# dirname=`dirname "$file"`
# # everything before last '/'
# basename=${file%/*}

# TODO If possible, get the lines colored (exe in green) or suffixed (`*' for
# exe, `/' for dir, etc.)
ff ()
{
    find . -name $@ -print 2>&1 | grep -v "find:"
}

safetmp ()
{
    test -d $HOME || exit 1
    test -d $HOME/tmp || mkdir $HOME/tmp
    echo $HOME/tmp/safetmp.$(hostname).$(date +%s).$$
}

# Copies my public key to the given server
sendkey ()
{
    local HOSTNAME="$*"
    scp $HOME/.ssh/id_rsa.pub $USER@$HOSTNAME:/home/$DOMAIN/$USER/.ssh/authorized_keys
    # The PuTTY developers strongly recommend you use RSA
}

# Copies my `.bashrc' to the given server
sendbash ()
{
    local HOSTNAME="$*"
    scp $HOME/.bashrc $USER@$HOSTNAME:/home/$DOMAIN/$USER/.bashrc
}

# Copies my public key and bashrc to the given server
rsetup ()
{
    local HOSTNAME="$*"
    sendkey $HOSTNAME
    sendbash $HOSTNAME
}

# gpg
searchkey ()
{
    gpg --keyserver pgp.mit.edu --fingerprint --search-key "$@";
}

#*** GPG functions

encrypt ()
{
    # Use ascii armor
    gpg -ac --no-options "$1"
}

bencrypt ()
{
    # No ascii armor
    # Encrypt binary data. jpegs/gifs/vobs/etc.
    gpg -c --no-options "$1"
}

decrypt ()
{
    gpg --no-options "$1"
}

pe ()
{
# Passphrase encryption program
# Created by Dave Crouse 01-13-2006
# Reads input from text editor and encrypts to screen.
    clear
    echo "         Passphrase Encryption Program";
    echo "--------------------------------------------------"; echo "";
    which $EDITOR &>/dev/null
    if [ $? != "0" ]; then
        echo "It appears that you do not have a text editor set in your .bashrc file.";
        echo "What editor would you like to use ? " ;
        read EDITOR ; echo "";
    fi
    echo "Enter the name/comment for this message :"
    read comment
    $EDITOR passphraseencryption
    gpg --armor --comment "$comment" --no-options --output
    passphraseencryption.gpg --symmetric passphraseencryption
    shred -u passphraseencryption ; clear
    echo "Outputting passphrase encrypted message"; echo "" ; echo "" ;
    cat passphraseencryption.gpg ; echo "" ; echo "" ;
    shred -u passphraseencryption.gpg ;
    read -p "Hit enter to exit" temp; clear
}

keys ()
{
    # Opens up kgpg keymanager
    kgpg -k
}

encryptfile ()
{
    zenity --title="zcrypt: Select a file to encrypt" --file-selection > zcrypt
    encryptthisfile=`cat zcrypt`;rm zcrypt
    # Use ascii armor
    #  --no-options (for NO gui usage)
    gpg -acq --yes ${encryptthisfile}
    zenity --info --title "File Encrypted" --text "$encryptthisfile has been encrypted"
}

decryptfile ()
{
    zenity --title="zcrypt: Select a file to decrypt" --file-selection > zcrypt
    decryptthisfile=`cat zcrypt`;rm zcrypt
    # NOTE: This will OVERWRITE existing files with the same name !!!
    gpg --yes -q ${decryptthisfile}
    zenity --info --title "File Decrypted" --text "$encryptthisfile has been decrypted"
}


# # have one SSH agent ready at all times
# if [ "$SSH_AUTH_SOCK" = "" ]; then
#     # check to see if there's an ssh-agent running
#     eval $(ssh-agent)
#     ssh-add
# fi

#*** Unison

# unison the current working directory only
uwd ()
{
    p=$(pwd -P)
    p=${p#*$HOME/my-unison-root/}
    p=${p#*$HOME/my-unison-root}

    if [ -d "$HOME/my-unison-root/$p" ]; then
        unison profile-name-for-uwd -path "$p"
    else
        echo "$p is not a directory in a Unison hierarchy on this machine"
    fi
}


# look for definitions
jargon ()
{
    BROWSER="links"
    JARGON_URL="http://info.astrian.net/jargon/terms"
    for i in ${*}; do
        ${BROWSER} ${JARGON_URL}/${i}.html
    done
}

# acronym finder
acro ()
{
    if [ $# = 0 ]; then
        echo "Usage: $0 acronym"
        echo "Purpose: expand an acronym"
    else
       #links "http://www.ucc.ie/cgi-bin/acronym?$1"
        links "http://www.acronymfinder.com/af-query.asp?String=exact&Acronym=$1"
    fi
}

# current weather forecasts
alias weather="lynx term=vt100 http://weather.ec.gc.ca/forecast/city_e.html?yyz"

# nmap ()
# {
#     echo "Enter port #"
#     read port
#     echo "Enter IP range"
#     read range
#     sudo nmap -sT -p $port -P0 -v -T 4 -oG dump-$port-${range////_}.txt $range
#     grep -i open dump-$port-${range////_}.txt
# }

timesync ()
{
    if [ $(id -u) = 0 ]; then
        ntpdate -u swisstime.ethz.ch
    else
        echo "Must be root"
    fi
}

# Searching for keyword(s) with Google
google ()
{
    w3m "http://www.google.com/search?q="$1"";
}


# immediately opens the first match
texman ()
{
    locate $* | grep pdf | grep texlive | head -1 | xargs open;
}

texlist ()
{
    locate $* | grep "\(pdf\|dvi\)" | grep "\ (texlive\|gwTeX\)";
}

# http_proxy="http://hellman:8080"
#+end_src

