README.html
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">4.7</span> Next</h3>
<div class="outline-text-3 org-src-container" id="text-4-7">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">ALTER the ORIGINAL meaning of existing commands (that scripts don't</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">expect to see modified!)</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">df</span>=<span class="org-string">'df -kTh'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">du</span>=<span class="org-string">'du -kh'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">cp</span>=<span class="org-string">'cp -i'</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">confirm copy over an existing file</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">mv</span>=<span class="org-string">'mv -i'</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">confirm move over an existing file</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">rm</span>=<span class="org-string">'rm -i'</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">confirm removing file (prevent some accidental mistakes)</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">ssh</span>=<span class="org-string">"ssh -C"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">more</span>=<span class="org-string">"less"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">rmdir</span>=<span class="org-string">"rm -fr"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">path</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">where</span>=<span class="org-string">'type -all'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">start up Windows applications associated with a particular file extension</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">directly from the Bash prompt</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">start</span>=<span class="org-string">"cmd /c start"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">start</span>=<span class="org-string">"cygstart"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">under Cygwin</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">lo</span>=<span class="org-string">"locate -i"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">case insensitive search</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">lg</span>=<span class="org-string">"locate -r '.*' | grep -i"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">mkall</span>=<span class="org-string">"./configure &amp;&amp; make &amp;&amp; sudo make install"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">tvm</span>=<span class="org-string">"tail -f /var/log/messages"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">sudo'ers</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">root</span>=<span class="org-string">"su - root"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">force the radio to always sync at 2 Mbps, even if other speeds are available</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">iwconfigslow</span>=<span class="org-string">"sudo iwconfig eth1 rate 2M"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">shortcuts</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">c</span>=<span class="org-string">"clear"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">E</span>=<span class="org-string">"env | sort"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">h</span>=<span class="org-string">"history 25"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">j</span>=<span class="org-string">"jobs -l"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">m</span>=$<span class="org-variable-name">PAGER</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">p</span>=$<span class="org-variable-name">PAGER</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">se</span>=<span class="org-string">"sudoedit"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">X</span>=<span class="org-string">"ssh-agent startx &amp;"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">z</span>=<span class="org-string">"suspend"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">misc commands</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">dos2unix</span>=<span class="org-string">"sed s/</span>
<span class="org-string">//g"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">unix2dos</span>=<span class="org-string">"sed s/\$/</span>
<span class="org-string">/"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">hgrep</span>=<span class="org-string">"history | grep"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">keyon</span>=<span class="org-string">"ssh-add -t 10800"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">add identity</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">keyoff</span>=<span class="org-string">"ssh-add -D"</span>       <span class="org-comment-delimiter"># </span><span class="org-comment">remove all identities</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">keylist</span>=<span class="org-string">"ssh-add -l"</span>      <span class="org-comment-delimiter"># </span><span class="org-comment">list all identities</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">kill9</span>=<span class="org-string">"kill -9"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">make an extract function!</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">tgz</span>=<span class="org-string">"tar -zxvf"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">tbz2</span>=<span class="org-string">"tar -jxvf"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">nfiles</span>=<span class="org-string">"find . -type f | wc -l"</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">ports</span>=<span class="org-string">"netstat -alpe --ip"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">most used programs</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">web</span>=<span class="org-string">"firefox &amp;"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">alias scan="nmap -sS -O"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">nm</span>=<span class="org-string">"nmap -sS -O -PI -PT"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">portscan</span>=<span class="org-string">"nmap -sT -PT -R "</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">anonymous wget (using Privoxy and Tor)</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">aget</span>=<span class="org-string">'wget --execute "http_proxy = http://127.0.0.1:8118" --proxy'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">mirror</span>=<span class="org-string">"wget -v --tries=0 --continue --force-directories --mirror --no-parent"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">ngrep -i -w 'user|pass' port 110</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ngrep -d eth0 -i 'USER|PASS' tcp port 80</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ngrep google port 80</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ngrep -i 'rcpt to|mail from' tcp port smtp</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ngrep -q -t -wi "login" port 23</span>


<span class="org-comment-delimiter">#</span><span class="org-comment">** 8.6 Programmable Completion</span>

complete -A helptopic help
complete -A hostname ssh telnet nmap rlogin ftp ping host traceroute nslookup rexec


<span class="org-comment-delimiter">#</span><span class="org-comment">** Misc functions</span>

<span class="org-function-name">saneperms</span> ()
{
    find . -type d -print0 | xargs -0 chmod 755
    find . -type f -print0 | xargs -0 chmod ${<span class="org-variable-name">1</span>:=644}
}


<span class="org-comment-delimiter"># </span><span class="org-comment"># search for various types or README file in dir and display them in $PAGER</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">readme ()</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">{</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">local files</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">files=(./(#i)*(read*me|lue*m(in|)ut)*(ND))</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">if (($#files)); then</span>
<span class="org-comment-delimiter">#         </span><span class="org-comment">$PAGER $files</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">else</span>
<span class="org-comment-delimiter">#         </span><span class="org-comment">print 'No README files.'</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">fi</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment"># Get a file's basename, dirname, extension, etc</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># get extension; everything after last '.'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ext=${file##*.}</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># basename</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">basename=`basename "$file"`</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># everything after last '/'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">basename=${file##*/}</span>
<span class="org-comment-delimiter">#</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># dirname</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">dirname=`dirname "$file"`</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># everything before last '/'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">basename=${file%/*}</span>

<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">TODO</span></span><span class="org-comment"> If possible, get the lines colored (exe in green) or suffixed (`*' for</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">exe, `/' for dir, etc.)</span>
<span class="org-function-name">ff</span> ()
{
    find . -name $<span class="org-variable-name">@</span> -print 2&gt;&amp;1 | grep -v <span class="org-string">"find:"</span>
}

<span class="org-function-name">safetmp</span> ()
{
    test -d $<span class="org-variable-name">HOME</span> || <span class="org-keyword">exit</span> 1
    test -d $<span class="org-variable-name">HOME</span>/tmp || mkdir $<span class="org-variable-name">HOME</span>/tmp
    <span class="org-builtin">echo</span> $<span class="org-variable-name">HOME</span>/tmp/safetmp.$(hostname).$(date +%s).$<span class="org-variable-name">$</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Copies my public key to the given server</span>
<span class="org-function-name">sendkey</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">HOSTNAME</span>=<span class="org-string">"$*"</span>
    scp $<span class="org-variable-name">HOME</span>/.ssh/id_rsa.pub $<span class="org-variable-name">USER</span>@$<span class="org-variable-name">HOSTNAME</span>:/home/$<span class="org-variable-name">DOMAIN</span>/$<span class="org-variable-name">USER</span>/.ssh/authorized_keys
    <span class="org-comment-delimiter"># </span><span class="org-comment">The PuTTY developers strongly recommend you use RSA</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Copies my `.bashrc' to the given server</span>
<span class="org-function-name">sendbash</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">HOSTNAME</span>=<span class="org-string">"$*"</span>
    scp $<span class="org-variable-name">HOME</span>/.bashrc $<span class="org-variable-name">USER</span>@$<span class="org-variable-name">HOSTNAME</span>:/home/$<span class="org-variable-name">DOMAIN</span>/$<span class="org-variable-name">USER</span>/.bashrc
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Copies my public key and bashrc to the given server</span>
<span class="org-function-name">rsetup</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">HOSTNAME</span>=<span class="org-string">"$*"</span>
    sendkey $<span class="org-variable-name">HOSTNAME</span>
    sendbash $<span class="org-variable-name">HOSTNAME</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">gpg</span>
<span class="org-function-name">searchkey</span> ()
{
    gpg --keyserver pgp.mit.edu --fingerprint --search-key <span class="org-string">"$@"</span>;
}

<span class="org-comment-delimiter">#</span><span class="org-comment">*** GPG functions</span>

<span class="org-function-name">encrypt</span> ()
{
    <span class="org-comment-delimiter"># </span><span class="org-comment">Use ascii armor</span>
    gpg -ac --no-options <span class="org-string">"$1"</span>
}

<span class="org-function-name">bencrypt</span> ()
{
    <span class="org-comment-delimiter"># </span><span class="org-comment">No ascii armor</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Encrypt binary data. jpegs/gifs/vobs/etc.</span>
    gpg -c --no-options <span class="org-string">"$1"</span>
}

<span class="org-function-name">decrypt</span> ()
{
    gpg --no-options <span class="org-string">"$1"</span>
}

<span class="org-function-name">pe</span> ()
{
<span class="org-comment-delimiter"># </span><span class="org-comment">Passphrase encryption program</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Created by Dave Crouse 01-13-2006</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Reads input from text editor and encrypts to screen.</span>
    clear
    <span class="org-builtin">echo</span> <span class="org-string">"         Passphrase Encryption Program"</span>;
    <span class="org-builtin">echo</span> <span class="org-string">"--------------------------------------------------"</span>; <span class="org-builtin">echo</span> <span class="org-string">""</span>;
    <span class="org-builtin">which</span> $<span class="org-variable-name">EDITOR</span> &amp;&gt;/dev/null
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> != <span class="org-string">"0"</span> ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"It appears that you do not have a text editor set in your .bashrc file."</span>;
        <span class="org-builtin">echo</span> <span class="org-string">"What editor would you like to use ? "</span> ;
        <span class="org-builtin">read</span> EDITOR ; <span class="org-builtin">echo</span> <span class="org-string">""</span>;
    <span class="org-keyword">fi</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Enter the name/comment for this message :"</span>
    <span class="org-builtin">read</span> comment
    $<span class="org-variable-name">EDITOR</span> passphraseencryption
    gpg --armor --comment <span class="org-string">"$comment"</span> --no-options --output
    passphraseencryption.gpg --symmetric passphraseencryption
    shred -u passphraseencryption ; clear
    <span class="org-builtin">echo</span> <span class="org-string">"Outputting passphrase encrypted message"</span>; <span class="org-builtin">echo</span> <span class="org-string">""</span> ; <span class="org-builtin">echo</span> <span class="org-string">""</span> ;
    cat passphraseencryption.gpg ; <span class="org-builtin">echo</span> <span class="org-string">""</span> ; <span class="org-builtin">echo</span> <span class="org-string">""</span> ;
    shred -u passphraseencryption.gpg ;
    <span class="org-builtin">read</span> -p <span class="org-string">"Hit enter to exit"</span> temp; clear
}

<span class="org-function-name">keys</span> ()
{
    <span class="org-comment-delimiter"># </span><span class="org-comment">Opens up kgpg keymanager</span>
    kgpg -k
}

<span class="org-function-name">encryptfile</span> ()
{
    zenity --title=<span class="org-string">"zcrypt: Select a file to encrypt"</span> --file-selection &gt; zcrypt
    <span class="org-variable-name">encryptthisfile</span>=<span class="org-sh-quoted-exec">`cat zcrypt`</span>;rm zcrypt
    <span class="org-comment-delimiter"># </span><span class="org-comment">Use ascii armor</span>
    <span class="org-comment-delimiter">#  </span><span class="org-comment">--no-options (for NO gui usage)</span>
    gpg -acq --yes ${<span class="org-variable-name">encryptthisfile</span>}
    zenity --info --title <span class="org-string">"File Encrypted"</span> --text <span class="org-string">"$encryptthisfile has been encrypted"</span>
}

<span class="org-function-name">decryptfile</span> ()
{
    zenity --title=<span class="org-string">"zcrypt: Select a file to decrypt"</span> --file-selection &gt; zcrypt
    <span class="org-variable-name">decryptthisfile</span>=<span class="org-sh-quoted-exec">`cat zcrypt`</span>;rm zcrypt
    <span class="org-comment-delimiter"># </span><span class="org-comment">NOTE: This will OVERWRITE existing files with the same name !!!</span>
    gpg --yes -q ${<span class="org-variable-name">decryptthisfile</span>}
    zenity --info --title <span class="org-string">"File Decrypted"</span> --text <span class="org-string">"$encryptthisfile has been decrypted"</span>
}


<span class="org-comment-delimiter"># </span><span class="org-comment"># have one SSH agent ready at all times</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">if [ "$SSH_AUTH_SOCK" = "" ]; then</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment"># check to see if there's an ssh-agent running</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">eval $(ssh-agent)</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">ssh-add</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">fi</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">*** Unison</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">unison the current working directory only</span>
<span class="org-function-name">uwd</span> ()
{
    <span class="org-variable-name">p</span>=$(<span class="org-builtin">pwd</span> -P)
    <span class="org-variable-name">p</span>=${<span class="org-variable-name">p</span>#*$<span class="org-variable-name">HOME</span>/my-unison-root/}
    <span class="org-variable-name">p</span>=${<span class="org-variable-name">p</span>#*$<span class="org-variable-name">HOME</span>/my-unison-root}

    <span class="org-keyword">if</span> [ -d <span class="org-string">"$HOME/my-unison-root/$p"</span> ]; <span class="org-keyword">then</span>
        unison profile-name-for-uwd -path <span class="org-string">"$p"</span>
    <span class="org-keyword">else</span>
        <span class="org-builtin">echo</span> <span class="org-string">"$p is not a directory in a Unison hierarchy on this machine"</span>
    <span class="org-keyword">fi</span>
}


<span class="org-comment-delimiter"># </span><span class="org-comment">look for definitions</span>
<span class="org-function-name">jargon</span> ()
{
    <span class="org-variable-name">BROWSER</span>=<span class="org-string">"links"</span>
    <span class="org-variable-name">JARGON_URL</span>=<span class="org-string">"http://info.astrian.net/jargon/terms"</span>
    <span class="org-keyword">for</span> i<span class="org-keyword"> in</span> ${<span class="org-variable-name">*</span>}; <span class="org-keyword">do</span>
        ${<span class="org-variable-name">BROWSER</span>} ${<span class="org-variable-name">JARGON_URL</span>}/${<span class="org-variable-name">i</span>}.html
    <span class="org-keyword">done</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">acronym finder</span>
<span class="org-function-name">acro</span> ()
{
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">#</span> = 0 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Usage: $0 acronym"</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Purpose: expand an acronym"</span>
    <span class="org-keyword">else</span>
       <span class="org-comment-delimiter">#</span><span class="org-comment">links "http://www.ucc.ie/cgi-bin/acronym?$1"</span>
        links <span class="org-string">"http://www.acronymfinder.com/af-query.asp?String=exact&amp;Acronym=$1"</span>
    <span class="org-keyword">fi</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">current weather forecasts</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">weather</span>=<span class="org-string">"lynx term=vt100 http://weather.ec.gc.ca/forecast/city_e.html?yyz"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">nmap ()</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">{</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">echo "Enter port #"</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">read port</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">echo "Enter IP range"</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">read range</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">sudo nmap -sT -p $port -P0 -v -T 4 -oG dump-$port-${range////_}.txt $range</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">grep -i open dump-$port-${range////_}.txt</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">}</span>

<span class="org-function-name">timesync</span> ()
{
    <span class="org-keyword">if</span> [ $(id -u) = 0 ]; <span class="org-keyword">then</span>
        ntpdate -u swisstime.ethz.ch
    <span class="org-keyword">else</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Must be root"</span>
    <span class="org-keyword">fi</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Searching for keyword(s) with Google</span>
<span class="org-function-name">google</span> ()
{
    w3m <span class="org-string">"http://www.google.com/search?q="</span>$<span class="org-variable-name">1</span><span class="org-string">""</span>;
}


<span class="org-comment-delimiter"># </span><span class="org-comment">immediately opens the first match</span>
<span class="org-function-name">texman</span> ()
{
    locate $<span class="org-variable-name">*</span> | grep pdf | grep texlive | head -1 | xargs open;
}

<span class="org-function-name">texlist</span> ()
{
    locate $<span class="org-variable-name">*</span> | grep <span class="org-string">"\(pdf\|dvi\)"</span> | grep <span class="org-string">"\ (texlive\|gwTeX\)"</span>;
}

<span class="org-comment-delimiter"># </span><span class="org-comment">http_proxy="http://hellman:8080"</span>
</pre></div>
</div>
