README.org
** Postamble

#+begin_src sh
#* Local Variables

# This is for the sake of Emacs.
# Local Variables:
# mode: shell-script
# mode: outline-minor
# sh-shell: bash
# End:

## .bashrc ends here
#+end_src

* Zsh specific
  :PROPERTIES:
  :tangle:   ./src/.zshrc
  :END:

** Examples

- [[http://aperiodic.net/phil/prompt/][Phil!'s ZSH Prompt]]
- [[http://stevelosh.com/blog/2010/02/my-extravagant-zsh-prompt/][My Extravagant Zsh Prompt]] (with Git Repository Information)

** Preamble

#+begin_src sh :noweb yes
## .zshrc --- Z Shell configuration file (for interactive shells)

# Copyright (C) 2009-<<current-year()>> Fabrice Niessen

# Author: Fabrice Niessen <(concat "fniessen" at-sign "pirilampo.org")>
# Keywords: zsh, dotfile, config

#* Install:

# For Cygwin users: Create a shortcut for zsh by using the `mkzsh' command.

#* Code:
#+end_src

** Variables

*** Search path

#+begin_src sh
# extend the PATH var
for MAYBE_PATH in "$HOME/bin" \
                  "$HOME/expect" \
                  "$HOME/winbin";
do
    # `-d' or `-x'?
    if [ -e $MAYBE_PATH ]; then
        PATH=$MAYBE_PATH:$PATH
    fi
done
#+end_src

*************** TODO Put the CWD (=.=) in PATH

If you add the CWD to your PATH, just do it:

- for *non-root users*,
- as the *last entry* (so, the current directory is only checked as a last
  resort).

#+begin_src sh
PATH=$PATH:.
#+end_src

*** Prompt

Zsh expects that every character in =PS1= will advance the cursor one space.
Wrap any non-printing escape sequences in =%{...%}=, and it should work. So use
=%{\e[31m%}=, etc.

#+begin_src sh
#** 13 (info "(zsh)Prompt Expansion")

# some colors
local BLACK=$'%{\e[1;30m%}'
local RED=$'%{\e[1;31m%}'
local green=$'%{\e[0;32m%}'
local GREEN=$'%{\e[1;32m%}'
local yellow=$'%{\e[0;33m%}'
local reset=$'%{\e[0m%}'

# TODO Insert beep when last command has failed
# custom prompt settings
PROMPT="$green%n@%m$BLACK:$yellow%2. %(?.$GREEN.$RED)%?$reset%(!.#.$) "
    # ? - exit code of the previous command
    # n - user name
    # m - machine name
    # . - abbreviated pwd
    # ! - su?
#+end_src

The tricky part was getting the syntax for testing the exit code. The syntax
is =%(x.true-string.false-string)=, where =x= is some arbitrary testing condition,
in this case, =?= for exit codes. After the first dot, if the test passes, show
true-string; if it fails, show false-string after the second dot.

https://github.com/olivierverdier/zsh-git-prompt

#+begin_src sh
# # prompt on the right hand side of the screen
# RPROMPT="[%t]"

# git info
. ~/Public/Repositories/git-prompt/zshrc.sh
RPROMPT='$(git_super_status)'
#+end_src

*** Command history

#+begin_src sh
# history
HISTFILE=$HOME/.histfile
HISTSIZE=1000
SAVEHIST=1000

# append new history lines instead of overwriting (important for multiple
# parallel Zsh sessions!)
setopt appendhistory

# don't save command more than once when occuring more often
setopt HIST_IGNORE_DUPS

# Use the same history file for all sessions
setopt SHARE_HISTORY
#+end_src

*** Term

Sett the terminal type explicitly:

#+begin_src sh
export TERM=xterm-256color
#+end_src

*** Display

