README.html
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">4.8</span> Postamble</h3>
<div class="outline-text-3 org-src-container" id="text-4-8">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">* Local Variables</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">This is for the sake of Emacs.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Local Variables:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mode: shell-script</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mode: outline-minor</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">sh-shell: bash</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">End:</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">.bashrc ends here</span>
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">5</span> Zsh specific</h2>
<div class="outline-text-2" id="text-5"></div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">5.1</span> Examples</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="http://aperiodic.net/phil/prompt/">Phil!'s ZSH Prompt</a></li>
<li><a href="http://stevelosh.com/blog/2010/02/my-extravagant-zsh-prompt/">My Extravagant Zsh Prompt</a> (with Git Repository Information)</li>
<li><a href="http://grml.org/zsh/zsh-lovers.html">zsh-lovers</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">5.2</span> Preamble</h3>
<div class="outline-text-3 org-src-container" id="text-5-2">
<pre class="src src-shell">
<span class="org-comment-delimiter">## </span><span class="org-comment">.zshrc --- Z Shell configuration file (for interactive shells)</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Copyright (C) 2009-2015 Fabrice Niessen</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Author: Fabrice Niessen &lt;(concat "fniessen" at-sign "pirilampo.org")&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Keywords: zsh, dotfile, config</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">* Install:</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">For Cygwin users: Create a shortcut for zsh by using the `mkzsh' command.</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">* Code:</span>
</pre></div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">5.3</span> Variables</h3>
<div class="outline-text-3" id="text-5-3"></div>
<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">5.3.1</span> Search path</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">extend the PATH var</span>
<span class="org-keyword">for</span> MAYBE_PATH<span class="org-keyword"> in</span> <span class="org-string">"$HOME/bin"</span> <span class="org-sh-escaped-newline">\</span>
                  <span class="org-string">"$HOME/expect"</span> <span class="org-sh-escaped-newline">\</span>
                  <span class="org-string">"$HOME/winbin"</span>;
<span class="org-keyword">do</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">`-d' or `-x'?</span>
    <span class="org-keyword">if</span> [ -e $<span class="org-variable-name">MAYBE_PATH</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">PATH</span>=$<span class="org-variable-name">MAYBE_PATH</span>:$<span class="org-variable-name">PATH</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span>
</pre></div>
<div class="inlinetask"><b><span class="todo TODO">TODO</span> Put the CWD (<code>.</code>) in PATH</b><br />
nil</div>
<p>If you add the CWD to your PATH, just do it:</p>
<ul class="org-ul">
<li>for <b>non-root users</b>,</li>
<li>as the <b>last entry</b> (so, the current directory is only checked as a last resort).</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-variable-name">PATH</span>=$<span class="org-variable-name">PATH</span>:.
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">5.3.2</span> Prompt</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>Zsh expects that every character in <code>PS1</code> will advance the cursor one space. Wrap any non-printing escape sequences in <code>%{...%}</code>, and it should work. So use <code>%{\e[31m%}</code>, etc.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 13 (info "(zsh)Prompt Expansion")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">some colors</span>
<span class="org-builtin">local</span> <span class="org-variable-name">BLACK</span>=$<span class="org-string">'%{\e[1;30m%}'</span>
<span class="org-builtin">local</span> <span class="org-variable-name">RED</span>=$<span class="org-string">'%{\e[1;31m%}'</span>
<span class="org-builtin">local</span> <span class="org-variable-name">green</span>=$<span class="org-string">'%{\e[0;32m%}'</span>
<span class="org-builtin">local</span> <span class="org-variable-name">GREEN</span>=$<span class="org-string">'%{\e[1;32m%}'</span>
<span class="org-builtin">local</span> <span class="org-variable-name">yellow</span>=$<span class="org-string">'%{\e[0;33m%}'</span>
<span class="org-builtin">local</span> <span class="org-variable-name">reset</span>=$<span class="org-string">'%{\e[0m%}'</span>

<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">TODO</span></span><span class="org-comment"> Insert beep when last command has failed</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">custom prompt settings</span>
<span class="org-variable-name">PROMPT</span>=<span class="org-string">"$green%n@%m$BLACK:$yellow%2. %(?.$GREEN.$RED)%?$reset%(!.#.$) "</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">? - exit code of the previous command</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">n - user name</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">m - machine name</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">. - abbreviated pwd</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">! - su?</span>
</pre></div>
<p>The tricky part was getting the syntax for testing the exit code. The syntax is <code>%(x.true-string.false-string)</code>, where <code>x</code> is some arbitrary testing condition, in this case, <code>?</code> for exit codes. After the first dot, if the test passes, show true-string; if it fails, show false-string after the second dot.</p>
<p><a href="https://github.com/olivierverdier/zsh-git-prompt">https://github.com/olivierverdier/zsh-git-prompt</a></p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment"># prompt on the right hand side of the screen</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">RPROMPT="[%t]"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">git info</span>
. ~/Public/Repositories/git-prompt/zshrc.sh
<span class="org-variable-name">RPROMPT</span>=<span class="org-string">'$(git_super_status)'</span>
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">5.3.3</span> Command history</h4>
<div class="outline-text-4 org-src-container" id="text-5-3-3">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">history</span>
<span class="org-variable-name">HISTFILE</span>=$<span class="org-variable-name">HOME</span>/.histfile
<span class="org-variable-name">HISTSIZE</span>=1000
<span class="org-variable-name">SAVEHIST</span>=1000

<span class="org-comment-delimiter"># </span><span class="org-comment">append new history lines instead of overwriting (important for multiple</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">parallel Zsh sessions!)</span>
<span class="org-builtin">setopt</span> appendhistory

<span class="org-comment-delimiter"># </span><span class="org-comment">don't save command more than once when occuring more often</span>
<span class="org-builtin">setopt</span> HIST_IGNORE_DUPS

<span class="org-comment-delimiter"># </span><span class="org-comment">Use the same history file for all sessions</span>
<span class="org-builtin">setopt</span> SHARE_HISTORY
</pre></div>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">5.3.4</span> Term</h4>
<div class="outline-text-4" id="text-5-3-4">
<p>Sett the terminal type explicitly:</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-builtin">export</span> <span class="org-variable-name">TERM</span>=xterm-256color
</pre></div>
</div>
</div>
