README.html
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">5.3.5</span> Display</h4>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">5.4</span> Aliasing</h3>
<div class="outline-text-3 org-src-container" id="text-5-4">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">some global aliases (expand whatever their position)</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">L</span>=<span class="org-string">"| less"</span> <span class="org-comment-delimiter">#######</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">M</span>=<span class="org-string">"| most"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">G</span>=<span class="org-string">'| grep -E'</span> <span class="org-comment-delimiter">######</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">W</span>=<span class="org-string">'| wc -l'</span> <span class="org-comment-delimiter">####</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">H</span>=<span class="org-string">'| head'</span> <span class="org-comment-delimiter">###</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">S</span>=<span class="org-string">'| sort'</span> <span class="org-comment-delimiter">###</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">T</span>=<span class="org-string">'| tail'</span> <span class="org-comment-delimiter">###</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">F</span>=<span class="org-string">' | fmt -'</span> <span class="org-comment-delimiter">##</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">21</span>=<span class="org-string">"2&gt;&amp;1"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">DN1</span>=<span class="org-string">'1&gt; /dev/null'</span> <span class="org-comment-delimiter">#</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">DN2</span>=<span class="org-string">'2&gt; /dev/null'</span> <span class="org-comment-delimiter">#</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">VM</span>=/var/log/messages
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A</span>=<span class="org-string">'| awk'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A1</span>=<span class="org-string">"| awk '{print \$1}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A2</span>=<span class="org-string">"| awk '{print \$2}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A3</span>=<span class="org-string">"| awk '{print \$3}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A4</span>=<span class="org-string">"| awk '{print \$4}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A5</span>=<span class="org-string">"| awk '{print \$5}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A6</span>=<span class="org-string">"| awk '{print \$6}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A7</span>=<span class="org-string">"| awk '{print \$7}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A8</span>=<span class="org-string">"| awk '{print \$8}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">A9</span>=<span class="org-string">"| awk '{print \$9}'"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">CA</span>=<span class="org-string">"| cat -A"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">ND</span>=<span class="org-string">'$(ls -d *(/om[1]))'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">newest directory</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">NF</span>=<span class="org-string">'$(ls *(.om[1]))'</span>    <span class="org-comment-delimiter"># </span><span class="org-comment">newest file</span>

<span class="org-builtin">alias</span> -g <span class="org-variable-name">EG</span>=<span class="org-string">'|&amp; egrep'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">EH</span>=<span class="org-string">'|&amp; head'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">EL</span>=<span class="org-string">'|&amp; less'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">ET</span>=<span class="org-string">'|&amp; tail'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">X</span>=<span class="org-string">'| xargs'</span>

<span class="org-builtin">alias</span> -- <span class="org-variable-name">cdwd</span>=<span class="org-string">'cd `pwd`'</span>
<span class="org-builtin">alias</span> -- <span class="org-variable-name">cwd</span>=<span class="org-string">'echo $cwd'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">h</span>=<span class="org-string">'history 1 | less +G'</span>
<span class="org-builtin">alias</span> -- <span class="org-variable-name">l</span>=<span class="org-string">'ls -lg'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">find</span>=<span class="org-string">'noglob find'</span>
</pre></div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">5.5</span> Ledger</h3>
<div class="outline-text-3 org-src-container" id="text-5-5">
<pre class="src src-shell">
<span class="org-builtin">export</span> <span class="org-variable-name">LEDGER</span>=ledger
<span class="org-builtin">export</span> <span class="org-variable-name">LEDGER_FILE</span>=/home/fni/Personal/Business/Accounting/LEDGER.dat

<span class="org-comment-delimiter"># </span><span class="org-comment">hledger print [REGEXP]... - show entries in Ledger format</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">! `hledger' is better than `ledger' in the sense that it does output</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">! 2 decimals whatever the figure, and that it does not output trailing</span>
    <span class="org-comment-delimiter">#</span><span class="org-comment">! spaces. There is no other difference (not even in indentation).</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">other problem with ledger: reports onto 81 columns when using other DATEFMT...</span>

<span class="org-builtin">alias</span> -g <span class="org-variable-name">LG</span>=<span class="org-string">"\$LEDGER -f \$LEDGER_FILE"</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">DATEFMT</span>=<span class="org-string">'-y %Y/%m/%d'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">for output</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">DAILY</span>=<span class="org-string">'--period "daily"'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">DLM</span>=<span class="org-string">'--display "d&gt;=[last month]"'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">display of last month</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">CLM</span>=<span class="org-string">'-p "last month"'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">computed total of last month</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">D1</span>=<span class="org-string">'--display "l&lt;=1" --depth 1'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">D2</span>=<span class="org-string">'--display "l&lt;=2" --depth 2'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">BALANCE_SHEET</span>=<span class="org-string">'^Assets ^Liabilities'</span>
<span class="org-builtin">alias</span> -g <span class="org-variable-name">PROFIT_LOSS</span>=<span class="org-string">'^Expenses ^Income'</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">lastmonth</span>=<span class="org-string">'LG reg TLM'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Ledger -f FILE [OPTIONS] [COMMAND [PATTERNS]]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Ledger using `ledger', `hledger' or `beancount' (see `$LEDGER')</span>
<span class="org-function-name">Ledger</span> ()
{
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">#</span> -lt 1 ]; <span class="org-keyword">then</span>
        cat &lt;&lt; EOF 1&gt;&amp;2
<span class="org-sh-heredoc">Usage: $(basename $0) -f FILE [OPTIONS] [COMMAND [PATTERNS]]</span>
<span class="org-sh-heredoc">    or $(basename $0) FILE   (if LEDGER=beancount)</span>
<span class="org-sh-heredoc">EOF</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">case</span> ${<span class="org-variable-name">LEDGER</span>} <span class="org-keyword">in</span>
        <span class="org-string">"beancount"</span> )
            ;;

        * )   <span class="org-comment-delimiter"># </span><span class="org-comment">default option</span>
            <span class="org-builtin">shift</span>;  <span class="org-comment-delimiter"># </span><span class="org-comment">for the useless (but expected) `-f'</span>
            ;;
    <span class="org-keyword">esac</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">LEDGER_M4_FILE</span>=$<span class="org-variable-name">1</span>; <span class="org-builtin">shift</span>;

    <span class="org-builtin">local</span> <span class="org-variable-name">LEDGER_FILE</span>=sample-ledger.dat;
    <span class="org-keyword">case</span> ${<span class="org-variable-name">LEDGER</span>} <span class="org-keyword">in</span>
        <span class="org-string">"beancount"</span> )
            m4 -D <span class="org-variable-name">LEDGER</span>=beancount ${<span class="org-variable-name">LEDGER_M4_FILE</span>} |<span class="org-sh-escaped-newline">\</span>
            sed -e <span class="org-string">'s/\(.*\)(\(.*\)) \(.*\)/\1\3 | \2/g'</span> &gt; ${<span class="org-variable-name">LEDGER_FILE</span>}
            bean-web ${<span class="org-variable-name">LEDGER_FILE</span>} $<span class="org-variable-name">@</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">beancount Web interface</span>
            ;;

        * )   <span class="org-comment-delimiter"># </span><span class="org-comment">default option</span>
            m4 ${<span class="org-variable-name">LEDGER_M4_FILE</span>} |<span class="org-sh-escaped-newline">\</span>
            sed -e <span class="org-string">'s/^@/;@/'</span> &gt; ${<span class="org-variable-name">LEDGER_FILE</span>}
            ${<span class="org-variable-name">LEDGER</span>} -f ${<span class="org-variable-name">LEDGER_FILE</span>} $<span class="org-variable-name">@</span>
            ;;
    <span class="org-keyword">esac</span>
    rm ${<span class="org-variable-name">LEDGER_FILE</span>}
}

<span class="org-comment-delimiter"># </span><span class="org-comment">cat file.ledger | sed -e 's/@check/;@check/' | xargs bean-web</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Use wrapper scripts around gpg with armor on (The --armor option means ascii</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">versus binary). You'll have to enter a password every time you want to run</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ledger.</span>
</pre></div>
</div>
