README.org
** Functions

#+begin_src sh
#** 9 (info "(zsh)Functions")

# ll ()
# {
#     ls -lag $* | more
# }

term ()
{
    setopt noglob;
    unset TERMCAP;
    eval `tset -s -I -Q - $*`
}

# hgrep PATTERN - print the history lines matching PATTERN
hgrep ()
{
    history 0 | grep $1
}
#+end_src

** Source common files

#+begin_src sh
#** 17 (info "(zsh)Shell Builtin Commands")

# source common aliases
if [ -r $HOME/.commonshrc ]; then
    . $HOME/.commonshrc
fi
#+end_src

** Line Editor

Useful keybindings:

- =M-q= ::
     Type another command in the middle of a long command (look at man, etc.).

- =M-.= ::
     Recall the last argument of the previous command, and so on.

- =C-r= ::
     Do an interactive search across all of the history.

Useful commands:

- =vared VAR= ::
     Interactively edit variable VAR.

#+begin_src sh
#** 18 (info "(zsh)Zsh Line Editor")

# behave like Emacs when editing
bindkey -e

# mappings for `Ctrl-up/down' for matching commands from the history
bindkey ';5A' history-search-backward
bindkey ';5B' history-search-forward

# mappings for `Ctrl-left/right' for word moving
bindkey ';5C' forward-word
bindkey ';5D' backward-word

# beep on errors
setopt beep

# making zsh beep like Bash when backspacing on an empty command line
backward-delete-char-beep ()
{
    if (( CURSOR == 0 )); then
        zle beep
    fi
    zle backward-delete-char
}
zle -N backward-delete-char-beep
bindkey "^?" backward-delete-char-beep
#+end_src

** Completion Widgets

#+begin_src sh
#** 19 (info "(zsh)Completion Widgets")

# load general completion
autoload -Uz compinit && compinit

# display a list of completions when you give an ambiguous choice (like Bash)
setopt autolist

# zsh will attempt to complete wildcards by expanding them in the command line
#+end_src

** Completion System

#+begin_src sh
#** 20 (info "(zsh)Completion System")

# case-insensitive completion
zstyle ':completion:*' matcher-list 'm:{a-zA-Z}={A-Za-z}'

if [ "$TERM" != "dumb" ]; then
    # eval "$(dircolors -b)"
    alias ls='ls --color=always'
else
    alias ls='ls -CF'
fi
#+end_src

** Zsh Modules

#+begin_src sh
## coloring stderr
STDERRRED=$'\e[031m'
zmodload zsh/system
color_err () {
    ## sysread & syswrite are part of `zsh/system'
    emulate -LR zsh
    while sysread
    do
        syswrite -o 2 "${STDERRRED}${REPLY}$terminfo[sgr0]"
    done
}

exec 2> >( color_err )
#+end_src

** Others

#+begin_src sh
# change directory given just path
setopt autocd

# use additional pattern matching features
setopt extendedglob

# unmatched patterns cause an error
setopt nomatch

# immediately report changes in background job status
setopt notify
#+end_src

#+begin_src sh
#* Local Variables

# This is for the sake of Emacs.
# Local Variables:
# mode: outline-minor
# End:

## .zshrc ends here
#+end_src

* Common
  :PROPERTIES:
  :tangle:   ./src/.commonshrc
  :END:

Everything in common between Bash and Z shell will come here.

** Preamble

#+begin_src sh :noweb yes
# Hey Emacs, this is a -*- sh -*- file
## .commonshrc --- Common features between (Linux and Cygwin) Bash and Z Shell

# Copyright (C) 2009-<<current-year()>> Fabrice Niessen

# Author: Fabrice Niessen <(concat "fniessen" at-sign "pirilampo.org")>
# Keywords: bash, zsh, dotfile, config
#+end_src

