README.html
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">5.6</span> Functions</h3>
<div class="outline-text-3 org-src-container" id="text-5-6">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 9 (info "(zsh)Functions")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">ll ()</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">{</span>
<span class="org-comment-delimiter">#     </span><span class="org-comment">ls -lag $* | more</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">}</span>

<span class="org-function-name">term</span> ()
{
    <span class="org-builtin">setopt</span> noglob;
    <span class="org-builtin">unset</span> TERMCAP;
    <span class="org-builtin">eval</span> <span class="org-sh-quoted-exec">`tset -s -I -Q - $*`</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">hgrep PATTERN - print the history lines matching PATTERN</span>
<span class="org-function-name">hgrep</span> ()
{
    <span class="org-builtin">history</span> 0 | grep $<span class="org-variable-name">1</span>
}
</pre></div>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">5.7</span> Source common files</h3>
<div class="outline-text-3 org-src-container" id="text-5-7">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 17 (info "(zsh)Shell Builtin Commands")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">source common aliases</span>
<span class="org-keyword">if</span> [ -r $<span class="org-variable-name">HOME</span>/.commonshrc ]; <span class="org-keyword">then</span>
    . $<span class="org-variable-name">HOME</span>/.commonshrc
<span class="org-keyword">fi</span>
</pre></div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">5.8</span> Line Editor</h3>
<div class="outline-text-3" id="text-5-8">
<p>Useful keybindings:</p>
<dl class="org-dl">
<dt><code>M-q</code></dt>
<dd>Type another command in the middle of a long command (look at man, etc.).</dd>
<dt><code>M-.</code></dt>
<dd>Recall the last argument of the previous command, and so on.</dd>
<dt><code>C-r</code></dt>
<dd>Do an interactive search across all of the history.</dd>
</dl>
<p>Useful commands:</p>
<dl class="org-dl">
<dt><code>vared VAR</code></dt>
<dd>Interactively edit variable VAR.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 18 (info "(zsh)Zsh Line Editor")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">behave like Emacs when editing</span>
<span class="org-builtin">bindkey</span> -e

<span class="org-comment-delimiter"># </span><span class="org-comment">mappings for `Ctrl-up/down' for matching commands from the history</span>
<span class="org-builtin">bindkey</span> <span class="org-string">';5A'</span> history-search-backward
<span class="org-builtin">bindkey</span> <span class="org-string">';5B'</span> history-search-forward

<span class="org-comment-delimiter"># </span><span class="org-comment">mappings for `Ctrl-left/right' for word moving</span>
<span class="org-builtin">bindkey</span> <span class="org-string">';5C'</span> forward-word
<span class="org-builtin">bindkey</span> <span class="org-string">';5D'</span> backward-word

<span class="org-comment-delimiter"># </span><span class="org-comment">beep on errors</span>
<span class="org-builtin">setopt</span> beep

<span class="org-comment-delimiter"># </span><span class="org-comment">making zsh beep like Bash when backspacing on an empty command line</span>
<span class="org-function-name">backward-delete-char-beep</span> ()
{
    <span class="org-keyword">if</span> (( <span class="org-variable-name">CURSOR</span> == 0 )); <span class="org-keyword">then</span>
        zle beep
    <span class="org-keyword">fi</span>
    zle backward-delete-char
}
zle -N backward-delete-char-beep
<span class="org-builtin">bindkey</span> <span class="org-string">"^?"</span> backward-delete-char-beep
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">5.9</span> Completion Widgets</h3>
<div class="outline-text-3 org-src-container" id="text-5-9">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 19 (info "(zsh)Completion Widgets")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">load general completion</span>
<span class="org-builtin">autoload</span> -Uz compinit &amp;&amp; compinit

<span class="org-comment-delimiter"># </span><span class="org-comment">display a list of completions when you give an ambiguous choice (like Bash)</span>
<span class="org-builtin">setopt</span> autolist

<span class="org-comment-delimiter"># </span><span class="org-comment">zsh will attempt to complete wildcards by expanding them in the command line</span>
</pre></div>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">5.10</span> Completion System</h3>
<div class="outline-text-3 org-src-container" id="text-5-10">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">** 20 (info "(zsh)Completion System")</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">case-insensitive completion</span>
zstyle <span class="org-string">':completion:*'</span> matcher-list <span class="org-string">'m:{a-zA-Z}={A-Za-z}'</span>

<span class="org-keyword">if</span> [ <span class="org-string">"$TERM"</span> != <span class="org-string">"dumb"</span> ]; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">eval "$(dircolors -b)"</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">ls</span>=<span class="org-string">'ls --color=always'</span>
<span class="org-keyword">else</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">ls</span>=<span class="org-string">'ls -CF'</span>
<span class="org-keyword">fi</span>
</pre></div>
</div>
<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">5.11</span> Zsh Modules</h3>
<div class="outline-text-3 org-src-container" id="text-5-11">
<pre class="src src-shell">
<span class="org-comment-delimiter">## </span><span class="org-comment">coloring stderr</span>
<span class="org-variable-name">STDERRRED</span>=$<span class="org-string">'\e[1;31m'</span>
zmodload zsh/system
<span class="org-function-name">color_err</span> () {
    <span class="org-comment-delimiter">## </span><span class="org-comment">sysread &amp; syswrite are part of `zsh/system'</span>
    emulate -LR zsh
    <span class="org-keyword">while</span> sysread
    <span class="org-keyword">do</span>
        syswrite -o 2 <span class="org-string">"${STDERRRED}${REPLY}$terminfo[sgr0]"</span>
    <span class="org-keyword">done</span>
}

<span class="org-keyword">exec</span> 2&gt; &gt;( color_err )
</pre></div>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">5.12</span> Others</h3>
<div class="outline-text-3" id="text-5-12">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">change directory given just path</span>
<span class="org-builtin">setopt</span> autocd

<span class="org-comment-delimiter"># </span><span class="org-comment">use additional pattern matching features</span>
<span class="org-builtin">setopt</span> extendedglob

<span class="org-comment-delimiter"># </span><span class="org-comment">unmatched patterns cause an error</span>
<span class="org-builtin">setopt</span> nomatch

<span class="org-comment-delimiter"># </span><span class="org-comment">immediately report changes in background job status</span>
<span class="org-builtin">setopt</span> notify
</pre></div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">* Local Variables</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">This is for the sake of Emacs.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Local Variables:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mode: outline-minor</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">End:</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">.zshrc ends here</span>
</pre></div>
</div>
</div>
</div>
<div id="outline-container-orgheadline51" class="outline-2">
<h2 id="orgheadline51"><span class="section-number-2">6</span> Common</h2>
<div class="outline-text-2" id="text-6">
<p>Everything in common between Bash and Z shell will come here.</p>
</div>
<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">6.1</span> Preamble</h3>
<div class="outline-text-3 org-src-container" id="text-6-1">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">Hey Emacs, this is a -*- sh -*- file</span>
<span class="org-comment-delimiter">## </span><span class="org-comment">.commonshrc --- Common features between (Linux and Cygwin) Bash and Z Shell</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Copyright (C) 2009-2015 Fabrice Niessen</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Author: Fabrice Niessen &lt;(concat "fniessen" at-sign "pirilampo.org")&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Keywords: bash, zsh, dotfile, config</span>
</pre></div>
</div>
