README.org
** Default editor

Be sure one of these *editors* is *in your search path*!

Note -- Right now, I have instead hard-coded the path to Emacs in the
[[file:~/bin/emacsclient]] script.

#+begin_src sh
# set the user's preferred text editor
for editor in emacsclientw emacsclient emacs vi; do
    # find a suitable editor
    if $(which $editor >& /dev/null); then
        case $editor in
            # emacsclient*)
            #     # # doesn't bother waiting for a response
            #     # export EDITOR="$editor --no-wait"
            #     export EDITOR="$editor -t"
            #     ;;
            ,*)
                export EDITOR="$editor"
                ;;
        esac
        alias e="$EDITOR"
        alias edit="$EDITOR"
        break
    fi
done

# FIXME 2010-11-04 This causes problems when scp'ing .bash_profile (for
# example) when this .bashrc is deployed onto the remote SSH server.
# [ -z "$EDITOR" ] && echo "No suitable editor found."
# [ -z "$EDITOR" ] || showvalue EDITOR

# use `$EDITOR' for programs wanting an editor
export VISUAL="$EDITOR" # for crontab
export CVSEDITOR="$EDITOR"
export SVN_EDITOR="$EDITOR"
export EDIT="$EDITOR"
export ERROR_EDITOR="$EDITOR"
export FCEDIT="$EDITOR" # for the fc (fix command) builtin command
#+end_src

#+begin_src sh :tangle no
alias e="emacsclient -a emacs -n"       # -n is essential part
#+end_src

** Aliases

Aliases are abbreviations or alternative names (usually mnemonics) for
commands. They are commonly used to specify a few options to commands, and
then include the rest of the command line.

Aliases should usually be kept simple. If not, they should be converted to:
- shell functions, or
- shell scripts.

An alias cannot have an argument like =$1=.

#+begin_src sh
#* Aliasing

LS_OPTIONS="$LS_OPTIONS --show-control-chars"

# enable color support of ls
if [ "$TERM" != "dumb" ]; then

    # # add my coloration scheme to directory listings
    # if [ -f $HOME/.dircolors ]; then
    #     eval "$(dircolors -b $HOME/.dircolors)"
    # else
    #     eval "$(dircolors -b)"
    # fi

    alias ls='ls --color=auto'
    alias ll="ls --color=yes --all --group-directories-first -l --human-readable --no-group"
            # long listing and hidden files
fi

alias -- ..='cd ..'
alias ...='cd ../..'
alias ....='cd ../../..'
alias .....='cd ../../../..'

alias s=sudo
alias w=which
alias q='clear && exit' # `x' is left for X Server...

# print PATH with each directory on a new line
alias path='echo $PATH | sed -e "s/:/\n/g"'

alias apts='aptitude search'
alias apti='sudo aptitude install --with-recommends'
alias aptrm='sudo aptitude remove'
#+end_src

** Emacs / Org

#+begin_src sh
alias em=emacs-minimal
#+end_src

For branches for which we want to make some development, and keep in track with
=master=:

#+begin_src sh
update_org () {
    (   # Directory changes made in a subshell do not carry over to the parent shell.
        cd $HOME/Public/Repositories/org-mode;
        git fetch --all --verbose \
            && git rebase origin \
            && make autoloads \
            && echo DON\'T make clean \
            && echo DON\'T make \
            && echo DON\'T sudo make install \
            && echo DON\'T make doc \
            && make info \
            && sudo make install-info \
            && printf "Running org_test, please wait (this can take a while)...\n" \
            && org_test 2>&1 >/dev/null | tail -n 3
    )
}
#+end_src

#+begin_src sh
org_test () {
    (
        cd $HOME/Public/Repositories/org-mode;
        mkdir /tmp/tmp-orgtest 2> /dev/null # TMPDIR must exist!
        TMPDIR=/tmp/tmp-orgtest emacs -Q --batch -L lisp/ -L testing/ -l org-test.el --eval '(setq org-confirm-babel-evaluate nil)' -f org-test-run-batch-tests
    )
}
#+end_src

#+begin_src sh
if [ -d "$HOME/Public/Repositories/org-bash-utils" ]
then
    PATH="$HOME/Public/Repositories/org-bash-utils:$PATH"
    source $HOME/Public/Repositories/org-bash-utils/org-alias
    source $HOME/Public/Repositories/org-bash-utils/awk-alias
fi
#+end_src

