README.html
<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">6.2</span> Default editor</h3>
<div class="outline-text-3" id="text-6-2">
<p>Be sure one of these <b>editors</b> is <b>in your search path</b>!</p>
<p>Note - Right now, I have instead hard-coded the path to Emacs in the <a href="file://d:/Users/fni/bin/emacsclient">file://d:/Users/fni/bin/emacsclient</a> script.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">set the user's preferred text editor</span>
<span class="org-keyword">for</span> editor<span class="org-keyword"> in</span> emacsclientw emacsclient emacs vi; <span class="org-keyword">do</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">find a suitable editor</span>
    <span class="org-keyword">if</span> $(<span class="org-builtin">which</span> $<span class="org-variable-name">editor</span> &gt;&amp; /dev/null); <span class="org-keyword">then</span>
        <span class="org-keyword">case</span> $<span class="org-variable-name">editor</span><span class="org-keyword"> in</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">emacsclient*)</span>
            <span class="org-comment-delimiter">#     </span><span class="org-comment"># # doesn't bother waiting for a response</span>
            <span class="org-comment-delimiter">#     </span><span class="org-comment"># export EDITOR="$editor --no-wait"</span>
            <span class="org-comment-delimiter">#     </span><span class="org-comment">export EDITOR="$editor -t"</span>
            <span class="org-comment-delimiter">#     </span><span class="org-comment">;;</span>
            *)
                <span class="org-builtin">export</span> <span class="org-variable-name">EDITOR</span>=<span class="org-string">"$editor"</span>
                ;;
        <span class="org-keyword">esac</span>
        <span class="org-builtin">alias</span> <span class="org-variable-name">e</span>=<span class="org-string">"$EDITOR"</span>
        <span class="org-builtin">alias</span> <span class="org-variable-name">edit</span>=<span class="org-string">"$EDITOR"</span>
        <span class="org-keyword">break</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span>

<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">FIXME</span></span><span class="org-comment"> 2010-11-04 This causes problems when scp'ing .bash_profile (for</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">example) when this .bashrc is deployed onto the remote SSH server.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">[ -z "$EDITOR" ] &amp;&amp; echo "No suitable editor found."</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">[ -z "$EDITOR" ] || showvalue EDITOR</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">use `$EDITOR' for programs wanting an editor</span>
<span class="org-builtin">export</span> <span class="org-variable-name">VISUAL</span>=<span class="org-string">"$EDITOR"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">for crontab</span>
<span class="org-builtin">export</span> <span class="org-variable-name">CVSEDITOR</span>=<span class="org-string">"$EDITOR"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">SVN_EDITOR</span>=<span class="org-string">"$EDITOR"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">EDIT</span>=<span class="org-string">"$EDITOR"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">ERROR_EDITOR</span>=<span class="org-string">"$EDITOR"</span>
<span class="org-builtin">export</span> <span class="org-variable-name">FCEDIT</span>=<span class="org-string">"$EDITOR"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">for the fc (fix command) builtin command</span>
</pre></div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-builtin">alias</span> <span class="org-variable-name">e</span>=<span class="org-string">"emacsclient -a emacs -n"</span>       <span class="org-comment-delimiter"># </span><span class="org-comment">-n is essential part</span>
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">6.3</span> Aliases</h3>
<div class="outline-text-3" id="text-6-3">
<p>Aliases are abbreviations or alternative names (usually mnemonics) for commands. They are commonly used to specify a few options to commands, and then include the rest of the command line.</p>
<p>Aliases should usually be kept simple. If not, they should be converted to:</p>
<ul class="org-ul">
<li>shell functions, or</li>
<li>shell scripts.</li>
</ul>
<p>An alias cannot have an argument like <code>$1</code>.</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">* Aliasing</span>

<span class="org-variable-name">LS_OPTIONS</span>=<span class="org-string">"$LS_OPTIONS --show-control-chars"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">enable color support of ls</span>
<span class="org-keyword">if</span> [ <span class="org-string">"$TERM"</span> != <span class="org-string">"dumb"</span> ]; <span class="org-keyword">then</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment"># add my coloration scheme to directory listings</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">if [ -f $HOME/.dircolors ]; then</span>
    <span class="org-comment-delimiter">#     </span><span class="org-comment">eval "$(dircolors -b $HOME/.dircolors)"</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">else</span>
    <span class="org-comment-delimiter">#     </span><span class="org-comment">eval "$(dircolors -b)"</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">fi</span>

    <span class="org-builtin">alias</span> <span class="org-variable-name">ls</span>=<span class="org-string">'ls --color=auto'</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">ll</span>=<span class="org-string">"ls --color=yes --all --group-directories-first -l --human-readable --no-group"</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">long listing and hidden files</span>
<span class="org-keyword">fi</span>

<span class="org-builtin">alias</span> -- ..=<span class="org-string">'cd ..'</span>
<span class="org-builtin">alias</span> ...=<span class="org-string">'cd ../..'</span>
<span class="org-builtin">alias</span> ....=<span class="org-string">'cd ../../..'</span>
<span class="org-builtin">alias</span> .....=<span class="org-string">'cd ../../../..'</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">g</span>=git
<span class="org-builtin">alias</span> <span class="org-variable-name">s</span>=sudo
<span class="org-builtin">alias</span> <span class="org-variable-name">w</span>=which

<span class="org-comment-delimiter"># </span><span class="org-comment">print PATH with each directory on a new line</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">path</span>=<span class="org-string">'echo $PATH | sed -e "s/:/\n/g"'</span>

<span class="org-builtin">alias</span> <span class="org-variable-name">apts</span>=<span class="org-string">'aptitude search'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">apti</span>=<span class="org-string">'sudo aptitude install --with-recommends'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">aptrm</span>=<span class="org-string">'sudo aptitude remove'</span>
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">6.4</span> Emacs / Org</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-builtin">alias</span> <span class="org-variable-name">em</span>=emacs-minimal
</pre></div>
<p>For branches for which we want to make some development, and keep in track with <code>master</code>:</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-function-name">update_org</span> () {
    (   <span class="org-comment-delimiter"># </span><span class="org-comment">Directory changes made in a subshell do not carry over to the parent shell.</span>
        <span class="org-builtin">cd</span> $<span class="org-variable-name">HOME</span>/Public/Repositories/org-mode;
        git fetch --all --verbose <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; git rebase origin <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; make autoloads <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; <span class="org-builtin">echo</span> DON<span class="org-string">\'</span>T make clean <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; <span class="org-builtin">echo</span> DON<span class="org-string">\'</span>T make <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; <span class="org-builtin">echo</span> DON<span class="org-string">\'</span>T sudo make install <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; <span class="org-builtin">echo</span> DON<span class="org-string">\'</span>T make doc <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; make info <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; sudo make install-info <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; printf <span class="org-string">"Running org_test, please wait (this can take a while)...\n"</span> <span class="org-sh-escaped-newline">\</span>
            &amp;&amp; org_test 2&gt;&amp;1 &gt;/dev/null | tail -n 3
    )
}
</pre></div>
<div class="inlinetask"><b><span class="todo TODO">TODO</span> Don't regenerate autoloads, doc, etc. if nothing new was pulled</b><br />
nil</div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-function-name">org_test</span> () {
    (
        <span class="org-builtin">cd</span> $<span class="org-variable-name">HOME</span>/Public/Repositories/org-mode;
        mkdir /tmp/tmp-orgtest 2&gt; /dev/null <span class="org-comment-delimiter"># </span><span class="org-comment">TMPDIR must exist!</span>
        <span class="org-variable-name">TMPDIR</span>=/tmp/tmp-orgtest emacs -Q --batch -L lisp/ -L testing/ -l org-test.el --eval <span class="org-string">'(setq org-confirm-babel-evaluate nil)'</span> -f org-test-run-batch-tests
    )
}
</pre></div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-keyword">if</span> [ -d <span class="org-string">"$HOME/Public/Repositories/org-bash-utils"</span> ]
<span class="org-keyword">then</span>
    <span class="org-variable-name">PATH</span>=<span class="org-string">"$HOME/Public/Repositories/org-bash-utils:$PATH"</span>
    <span class="org-builtin">source</span> $<span class="org-variable-name">HOME</span>/Public/Repositories/org-bash-utils/org-alias
    <span class="org-builtin">source</span> $<span class="org-variable-name">HOME</span>/Public/Repositories/org-bash-utils/awk-alias
<span class="org-keyword">fi</span>
</pre></div>
</div>
</div>
