README.org
** Next

#+begin_src sh
# # dirty (?) hack
# alias killspell='kill `pidof hunspell`'
# # use `pkill' (which is pgrep + kill in a single command)

# use `htop' instead of `top'
# XXX sudo aptitude install htop
if $(which htop >& /dev/null); then
    alias top=htop
fi

# show only my processes
alias mytop='top -u $USERNAME'
alias mytop='htop -u $USERNAME'

# grep through the aliases
alias agrep='alias | grep -i'

# directory history
alias dh='dirs -v'

# play safe!
alias rm='rm -i'
alias mv='mv -i'
alias cp='cp -i'

# display the matched pattern in color
alias grep='grep --color'

# list all files modified in the last 24 hours (last full day)
alias oneday='find . -mtime -1 -print'

# XXX my traceroute
if $(which mtr >& /dev/null); then
    alias ping=mtr
fi

# hping[2] (run as root!)
alias myping="hping2 -c 100 -2 -p 7 $1"
alias myping2="hping2 -d 500 -c 100 -2 -p 7 $1"

# 030925 compare /proc with ps (against rootkits)
alias myps="sudo ls -d /proc/* | grep '[0-9]' | wc -l ; sudo ps ax | wc -l"

# get gpg-key from keyserver
alias getkey='gpg --keyserver keys.gnupg.net --recv-keys'

# 040210 grep
alias g='find . -type f -print0 | xargs -0 grep'

# search through files, ignoring .svn directories
alias svn_find="find . -not \( -name .svn -prune \)"

# function for grep'ing a string in every SVN revision of a file
# Usage: svn_grep_all_rev PATTERN FILE
svn_grep_all_rev() {
    svn log $2 | perl -n -e 'print "$1\n" if m/^r(\d*)\s+/' | (
        while read revision; do
            printf "\e[0;33m%s\e[0m\n" "Revision $revision:"
            svn cat -r $revision $2 | grep $1
            printf "\n"
        done
    )
}

# 040319 send files via netcat
# on sending side:
#  send() {j=$*; tar cpz ${j/%${!#}/}|nc -w 1 ${!#} 51330;}
#  send dir* $HOST
# Info:
#  ${!#} gibt den letzten Parameter (den Hostnamen) zurück,
#  ${j/%${!#}/} die übrigen (Liste der Dateien oder Verzeichnisse).
alias receive='nc -vlp 51330 | tar xzvp'


# If I want to find out which lines in a file are duplicated and want to print
# them, the following awk script helps:
# awk 'seen[$0]++ == 1' <filename>


# honor embedded linefeeds when displaying packets
alias ngrep='ngrep -W byline'

# echo my current external IP address
alias whatismyip='curl -s http://whatismyip.org'

# shortcut to making executable
alias exe='chmod +x'

# chown current dir and subdirs
alias own='sudo chown -R $USER'


# Web radio stations
alias europe1='mplayer http://vipicecast.yacast.net/europe1'
alias europe2='mplayer mms://vipmms9.yacast.fr/encodereurope2'
alias nrj='mplayer mms://vipnrj.yacast.fr/encodernrj'
alias rtl='mplayer http://streaming.radio.rtl.fr/rtl-1-44-96'
alias rtl2='mplayer http://streaming.radio.rtl.fr/rtl2-1-44-96'


alias off='sudo shutdown -h now'


case $(uname -s) in
    Linux*)
        alias vpnup='sudo test; exec sudo openvpn --config $HOME/.hide/OpenVPN-config/mcbe.ovpn --writepid /tmp/openvpn.pid &'  # --daemon'
        alias vpndown='sudo kill -INT `cat /tmp/openvpn.pid`'
        ;;

    CYGWIN*)
        alias vpnup='cd $HOME/.hide/OpenVPN-config; openvpn --config mcbe.ovpn --writepid c:/cygwin/tmp/openvpn.pid &'  # --daemon'
        alias vpndown='killall openvpn'
        ;;
esac

# make `du' human readable
alias du='du -h'
alias du1='du -h --max-depth=1'
alias dus='du -ms * | sort -rn'  # ordered by size

# make `df' human readable
alias df='df -h'


# `unp' is for archive extract

# dir
alias back="cd -"
alias home="cd $HOME"


export GS_OPTIONS="-sPAPERSIZE=a4"
alias pdfmerge="gs -dBATCH -dNOPAUSE -q -sDEVICE=pdfwrite -sOutputFile=./finished.pdf" # pdfjoin
alias booklet="psbook | psnup -2 | pstops '2:0,1U(21cm,29.7cm)'"
# for Win32, choose gswin32c
#+end_src

