README.html
<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">6.9</span> Next</h3>
<div class="outline-text-3 org-src-container" id="text-6-9">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment"># dirty (?) hack</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">alias killspell='kill `pidof hunspell`'</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># use `pkill' (which is pgrep + kill in a single command)</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">use `htop' instead of `top'</span>
<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">XXX</span></span><span class="org-comment"> sudo aptitude install htop</span>
<span class="org-keyword">if</span> $(<span class="org-builtin">which</span> htop &gt;&amp; /dev/null); <span class="org-keyword">then</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">top</span>=htop
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">show only my processes</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">mytop</span>=<span class="org-string">'top -u $USERNAME'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">mytop</span>=<span class="org-string">'htop -u $USERNAME'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">grep through the aliases</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">agrep</span>=<span class="org-string">'alias | grep -i'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">directory history</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">dh</span>=<span class="org-string">'dirs -v'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">play safe!</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">rm</span>=<span class="org-string">'rm -i'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">mv</span>=<span class="org-string">'mv -i'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">cp</span>=<span class="org-string">'cp -i'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">display the matched pattern in color</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">grep</span>=<span class="org-string">'grep --color'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">list all files modified in the last 24 hours (last full day)</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">oneday</span>=<span class="org-string">'find . -mtime -1 -print'</span>

<span class="org-comment-delimiter"># </span><span class="org-leuven-highlight"><span class="org-comment">XXX</span></span><span class="org-comment"> my traceroute</span>
<span class="org-keyword">if</span> $(<span class="org-builtin">which</span> mtr &gt;&amp; /dev/null); <span class="org-keyword">then</span>
    <span class="org-builtin">alias</span> <span class="org-variable-name">ping</span>=mtr
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">hping[2] (run as root!)</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">myping</span>=<span class="org-string">"hping2 -c 100 -2 -p 7 $1"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">myping2</span>=<span class="org-string">"hping2 -d 500 -c 100 -2 -p 7 $1"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">030925 compare /proc with ps (against rootkits)</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">myps</span>=<span class="org-string">"sudo ls -d /proc/* | grep '[0-9]' | wc -l ; sudo ps ax | wc -l"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">get gpg-key from keyserver</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">getkey</span>=<span class="org-string">'gpg --keyserver keys.gnupg.net --recv-keys'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment"># 040210 grep</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">alias g='find . -type f -print0 | xargs -0 grep'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">search through files, ignoring .svn directories</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svn_find</span>=<span class="org-string">"find . -not \( -name .svn -prune \)"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">function for grep'ing a string in every SVN revision of a file</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn_grep_all_rev PATTERN FILE</span>
<span class="org-function-name">svn_grep_all_rev</span>() {
    svn log $<span class="org-variable-name">2</span> | perl -n -e <span class="org-string">'print "$1\n" if m/^r(\d*)\s+/'</span> | (
        <span class="org-keyword">while </span><span class="org-builtin">read</span> revision; <span class="org-keyword">do</span>
            printf <span class="org-string">"\e[0;33m%s\e[0m\n"</span> <span class="org-string">"Revision $revision:"</span>
            svn cat -r $<span class="org-variable-name">revision</span> $<span class="org-variable-name">2</span> | grep $<span class="org-variable-name">1</span>
            printf <span class="org-string">"\n"</span>
        <span class="org-keyword">done</span>
    )
}

<span class="org-comment-delimiter"># </span><span class="org-comment">040319 send files via netcat</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">on sending side:</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">send() {j=$*; tar cpz ${j/%${!#}/}|nc -w 1 ${!#} 51330;}</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">send dir* $HOST</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Info:</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">${!#} gibt den letzten Parameter (den Hostnamen) zurück,</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">${j/%${!#}/} die übrigen (Liste der Dateien oder Verzeichnisse).</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">receive</span>=<span class="org-string">'nc -vlp 51330 | tar xzvp'</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">If I want to find out which lines in a file are duplicated and want to print</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">them, the following awk script helps:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">awk 'seen[$0]++ == 1' &lt;filename&gt;</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">honor embedded linefeeds when displaying packets</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">ngrep</span>=<span class="org-string">'ngrep -W byline'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">echo my current external IP address</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">whatismyip</span>=<span class="org-string">'curl -s http://whatismyip.org'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">shortcut to making executable</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">exe</span>=<span class="org-string">'chmod +x'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">chown current dir and subdirs</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">own</span>=<span class="org-string">'sudo chown -R $USER'</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">Web radio stations</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">europe1</span>=<span class="org-string">'mplayer http://vipicecast.yacast.net/europe1'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">europe2</span>=<span class="org-string">'mplayer mms://vipmms9.yacast.fr/encodereurope2'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">nrj</span>=<span class="org-string">'mplayer mms://vipnrj.yacast.fr/encodernrj'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">rtl</span>=<span class="org-string">'mplayer http://streaming.radio.rtl.fr/rtl-1-44-96'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">rtl2</span>=<span class="org-string">'mplayer http://streaming.radio.rtl.fr/rtl2-1-44-96'</span>


<span class="org-builtin">alias</span> <span class="org-variable-name">off</span>=<span class="org-string">'sudo shutdown -h now'</span>


<span class="org-keyword">case</span> $(uname -s) <span class="org-keyword">in</span>
    Linux*)
        <span class="org-builtin">alias</span> <span class="org-variable-name">vpnup</span>=<span class="org-string">'sudo test; exec sudo openvpn --config $HOME/.hide/OpenVPN-config/mcbe.ovpn --writepid /tmp/openvpn.pid &amp;'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">--daemon'</span>
        <span class="org-builtin">alias</span> <span class="org-variable-name">vpndown</span>=<span class="org-string">'sudo kill -INT `cat /tmp/openvpn.pid`'</span>
        ;;

    CYGWIN*)
        <span class="org-builtin">alias</span> <span class="org-variable-name">vpnup</span>=<span class="org-string">'cd $HOME/.hide/OpenVPN-config; openvpn --config mcbe.ovpn --writepid c:/cygwin/tmp/openvpn.pid &amp;'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">--daemon'</span>
        <span class="org-builtin">alias</span> <span class="org-variable-name">vpndown</span>=<span class="org-string">'killall openvpn'</span>
        ;;
<span class="org-keyword">esac</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">make `du' human readable</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">du</span>=<span class="org-string">'du -h'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">du1</span>=<span class="org-string">'du -h --max-depth=1'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">dus</span>=<span class="org-string">'du -ms * | sort -rn'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">ordered by size</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">make `df' human readable</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">df</span>=<span class="org-string">'df -h'</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">`unp' is for archive extract</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">dir</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">back</span>=<span class="org-string">"cd -"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">home</span>=<span class="org-string">"cd $HOME"</span>


<span class="org-builtin">export</span> <span class="org-variable-name">GS_OPTIONS</span>=<span class="org-string">"-sPAPERSIZE=a4"</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">pdfmerge</span>=<span class="org-string">"gs -dBATCH -dNOPAUSE -q -sDEVICE=pdfwrite -sOutputFile=./finished.pdf"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">pdfjoin</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">booklet</span>=<span class="org-string">"psbook | psnup -2 | pstops '2:0,1U(21cm,29.7cm)'"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">for Win32, choose gswin32c</span>
</pre></div>
</div>
