README.html
<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">6.10</span> Functions</h3>
<div class="outline-text-3 org-src-container" id="text-6-10">
<pre class="src src-shell">
<span class="org-comment-delimiter">#</span><span class="org-comment">* Functions</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">list all files modified today only (since start of day only, i.e. 00:00)</span>
<span class="org-function-name">today</span> ()
{
    touch -t <span class="org-sh-quoted-exec">`date +%m%d0000`</span> /tmp/$<span class="org-variable-name">$</span>
    find . -type f -newer /tmp/$<span class="org-variable-name">$</span>
    rm -f /tmp/$<span class="org-variable-name">$</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">ff PATTERN - find file named PATTERN</span>
<span class="org-function-name">ff</span> ()
{
    find . -name $<span class="org-variable-name">1</span> -print
}

<span class="org-comment-delimiter"># </span><span class="org-comment">files PATH - list files in PATH</span>
<span class="org-function-name">files</span> ()
{
    find $<span class="org-variable-name">1</span> -type f -print
}

<span class="org-comment-delimiter"># </span><span class="org-comment">line N FILE - show line N of FILE</span>
<span class="org-function-name">line</span> ()
{
    sed -n <span class="org-string">"$1 p"</span> $<span class="org-variable-name">2</span>
}
</pre></div>
</div>
<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">6.11</span> Emacsclient</h3>
<div class="outline-text-3" id="text-6-11">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">ec FILE - open FILE in a running Emacs</span>
<span class="org-function-name">ec</span> ()
{
    emacsclient --no-wait <span class="org-string">"$1"</span>
}
</pre></div>
<p>I connect to the server with either a terminal or a GUI client like this:</p>
<p>alias et=emacsclient -t # new GUI frame alias ec=emacsclient -c # new terminal frame</p>
</div>
</div>
<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">6.12</span> Other</h3>
<div class="outline-text-3 org-src-container" id="text-6-12">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">clean [-r] - remove useless files (recursively)</span>
<span class="org-function-name">clean</span> ()
{
    <span class="org-keyword">if</span> [ <span class="org-string">"$1"</span> = <span class="org-string">"-r"</span> ]; <span class="org-keyword">then</span>
        find . <span class="org-string">\(</span> -name <span class="org-string">"#*"</span> -o -name <span class="org-string">"*~"</span> -o -name <span class="org-string">".*~"</span> -o <span class="org-sh-escaped-newline">\</span>
            -name <span class="org-string">"*.~[0-9]*~"\ </span>-o -name <span class="org-string">".*.~[0-9]*~"</span> -o <span class="org-sh-escaped-newline">\</span>
            -name <span class="org-string">"*.~BASE~"</span> -o -name <span class="org-string">".*.~BASE~"</span> <span class="org-string">\)</span> -ok rm <span class="org-string">"{}"</span> <span class="org-string">";"</span>
    <span class="org-keyword">else</span>
        rm -i <span class="org-string">\#</span>* *~ .*~ *.~[0-9]*~ .*.~[0-9]*~ *.~BASE~ .*.~BASE~
    <span class="org-keyword">fi</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">swap FILE1 FILE2 - swap FILE1 and FILE2</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Useful when you want to try a config file obtained from elsewhere, and also</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">keep the old version.</span>
<span class="org-function-name">swap</span> ()
{
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">#</span> != 2 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">tmpfile</span>=/tmp/.swapper.$<span class="org-variable-name">$</span>.$<span class="org-variable-name">RANDOM</span>
    mv -f $<span class="org-variable-name">1</span> $<span class="org-variable-name">tmpfile</span>
    mv -f $<span class="org-variable-name">2</span> $<span class="org-variable-name">1</span>
    mv -f $<span class="org-variable-name">tmpfile</span> $<span class="org-variable-name">2</span>
    <span class="org-keyword">return</span> 0
}


<span class="org-comment-delimiter">#</span><span class="org-comment">** Networking toolbox</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">localnet - find the local network in CIDR notation</span>
<span class="org-function-name">localnet</span> ()
{
    <span class="org-variable-name">IP_ADDRESS</span>=$(ifconfig | grep <span class="org-string">"inet addr:"</span> | head -n 1 | sed <span class="org-string">"s/.*addr:\([0-9.]*\).*/\1/"</span>)
    <span class="org-comment-delimiter"># </span><span class="org-comment">we could use `nm-tool' from `network-manager'</span>

    <span class="org-variable-name">NETMASK</span>=$(ifconfig | grep <span class="org-string">"inet addr:"</span> | head -n 1 | sed <span class="org-string">"s/.*Mask:\([0-9.]*\).*/\1/"</span>)

    <span class="org-comment-delimiter"># </span><span class="org-comment">calculate network value</span>
    <span class="org-builtin">echo</span> $(ipcalc -n -b $<span class="org-variable-name">IP_ADDRESS</span> $<span class="org-variable-name">NETMASK</span> | grep Network | awk <span class="org-string">'{print $2}'</span>)
}


<span class="org-comment-delimiter"># </span><span class="org-comment">whoisonline [TARGET] - list hosts that are online</span>
<span class="org-function-name">whoisonline</span> ()
{
    <span class="org-builtin">local</span> net
    <span class="org-keyword">if</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">net</span>=<span class="org-string">"$1"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">net</span>=$(localnet)
    <span class="org-keyword">fi</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Discovering online hosts in $net..."</span>
    sudo nmap -sP $<span class="org-variable-name">net</span> | awk <span class="org-string">'/Host / &amp;&amp; / up/ { print $0; }'</span>
}


<span class="org-comment-delimiter"># </span><span class="org-comment">localps [TARGET] - list open ports on hosts that are online</span>
<span class="org-function-name">localps</span> ()
{
    <span class="org-builtin">local</span> hostip
    <span class="org-builtin">local</span> t1
    <span class="org-builtin">local</span> t2
    <span class="org-builtin">local</span> t3

    <span class="org-builtin">local</span> net
    <span class="org-keyword">if</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">net</span>=<span class="org-string">"$1"</span>
    <span class="org-keyword">else</span>
        <span class="org-variable-name">net</span>=$(localnet)
    <span class="org-keyword">fi</span>

    <span class="org-keyword">for</span> hostip<span class="org-keyword"> in</span> $(nmap -sP $<span class="org-variable-name">net</span> | grep -E <span class="org-string">'Host .* up'</span> | cut -d <span class="org-string">" "</span> -f2-2);
    <span class="org-keyword">do</span>
        <span class="org-variable-name">t1</span>=$(ping -c 4 $<span class="org-variable-name">hostip</span> | grep -e PING | cut -d <span class="org-string">" "</span> -f1-2 | cut -d <span class="org-string">" "</span> -f2-4) ;
        <span class="org-variable-name">t2</span>=$(ping -c 4 $<span class="org-variable-name">hostip</span> | grep -e rtt | cut -d <span class="org-string">"/"</span> -f5-5) ;
        <span class="org-variable-name">t3</span>=$(sudo nmap -sS $<span class="org-variable-name">hostip</span> | grep <span class="org-string">" open "</span>) ;
        <span class="org-builtin">echo</span> -e $<span class="org-variable-name">t1</span> <span class="org-string">" "</span> $<span class="org-variable-name">t2</span> <span class="org-string">"ms\n"</span> $<span class="org-variable-name">t3</span> <span class="org-string">"\n"</span>;
    <span class="org-keyword">done</span>
}


<span class="org-comment-delimiter"># </span><span class="org-comment">watchport HOST PORT - watch TCP port PORT on machine HOST</span>
<span class="org-function-name">watchport</span> ()
{
    <span class="org-keyword">while </span><span class="org-builtin">true</span>; <span class="org-keyword">do</span> clear; nmap $<span class="org-variable-name">1</span> -PN -p $<span class="org-variable-name">2</span>; sleep 5; <span class="org-keyword">done</span>
}


<span class="org-comment-delimiter"># </span><span class="org-comment">rdns [TARGET] - perform reverse DNS lookups</span>
<span class="org-function-name">rdns</span> ()
{
    <span class="org-builtin">local</span> net
    <span class="org-keyword">if</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">then</span>
      <span class="org-variable-name">net</span>=<span class="org-string">"$1"</span>
    <span class="org-keyword">else</span>
      <span class="org-variable-name">net</span>=$(localnet)
    <span class="org-keyword">fi</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Performing reverse DNS lookups in $net..."</span>
    nmap -R -sL $<span class="org-variable-name">net</span> |<span class="org-sh-escaped-newline">\</span>
    awk <span class="org-string">'{if ($3 != "not") print "Host " $3 " is " $2}'</span> | grep <span class="org-string">'('</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">You could add "--dns-servers x.x.x.x" after the "-sL" if you need the</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">lookups to be performed on a specific DNS server.</span>
}
</pre></div>
</div>
<div id="outline-container-orgheadline50" class="outline-3">
<h3 id="orgheadline50"><span class="section-number-3">6.13</span> Postamble</h3>
<div class="outline-text-3 org-src-container" id="text-6-13">
<pre class="src src-shell">
<span class="org-comment-delimiter"># </span><span class="org-comment">This is for the sake of Emacs.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Local Variables:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ispell-local-dictionary: "en_US"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">End:</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">.commonshrc ends here</span>
</pre></div>
</div>
</div>
