README.html
<div id="outline-container-orgheadline52" class="outline-2">
<h2 id="orgheadline52"><span class="section-number-2">7</span> InputRC</h2>
<div class="outline-text-2" id="text-7">
<p>This file controls the behavior of line input editing for programs that use the Gnu <b>Readline</b> library. Existing programs include FTP, Bash, and Gdb.</p>
<div class="note">
<p>Zsh doesn't use the <code>inputrc</code> file.</p>
</div>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-comment-delimiter">## </span><span class="org-comment">.inputrc --- my Readline Init File</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Copyright (C) 2005-2015 Fabrice Niessen</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Author: Fabrice Niessen &lt;(concat "fniessen" at-sign "pirilampo.org")&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Keywords: readline, dotfile, config</span>

<span class="org-comment-delimiter">#    </span><span class="org-comment">_                   _</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">(_)_ __  _ __  _   _| |_ _ __ ___</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">| | '_ \| '_ \| | | | __| '__/ __|</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">_| | | | | |_) | |_| | |_| | | (__</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">(_)_|_| |_| .__/ \__,_|\__|_|  \___|</span>
<span class="org-comment-delimiter">#           </span><span class="org-comment">|_|</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">This file is free software; you can redistribute it and/or</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">modify it under the terms of the GNU General Public License as</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">published by the Free Software Foundation; either version 2 of</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the License, or (at your option) any later version.</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">This file is distributed in the hope that it will be</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">useful, but WITHOUT ANY WARRANTY; without even the implied</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">PURPOSE.  See the GNU General Public License for more details.</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">You should have received a copy of the GNU General Public</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">License along with this file; if not, write to the Free</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Software Foundation, Inc., 59 Temple Place - Suite 330, Boston,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">MA 02111-1307, USA.</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">* Code:</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">modify to taste</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">first, include any system-wide settings (ignored if one has his own</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">`.inputrc')</span>
$<span class="org-variable-name">include</span> /etc/skel/.inputrc
$<span class="org-variable-name">include</span> /etc/inputrc

<span class="org-comment-delimiter"># </span><span class="org-comment">allow Meta (Alt) key bindings [line added to the top of my `.inputrc']</span>
<span class="org-builtin">set</span> convert-meta on

<span class="org-comment-delimiter"># </span><span class="org-comment">behave like Emacs when editing</span>
<span class="org-builtin">set</span> editing-mode emacs
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-a/e      Start/End of line</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-f/b      Forward/Backward one character</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-d        Delete one character</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-k        Kill line</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-p/n      Previous/Next command in history</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-r        Search for command in history</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Ctrl-i/TAB    File name completion</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">some defaults / modifications for the Emacs mode</span>
$<span class="org-variable-name">if</span> <span class="org-variable-name">mode</span>=emacs

<span class="org-comment-delimiter"># </span><span class="org-comment">mappings for `Ctrl-up/down' for matching commands from the history</span>
<span class="org-string">"\e[1;5A"</span>: history-search-backward
<span class="org-string">"\e[1;5B"</span>: history-search-forward

<span class="org-comment-delimiter"># </span><span class="org-comment">mappings for `Ctrl-left/right' for word moving</span>
<span class="org-string">"\e[1;5C"</span>: forward-word
<span class="org-string">"\e[1;5D"</span>: backward-word

Meta-p: history-search-backward
Meta-n: history-search-forward

$<span class="org-variable-name">endif</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">ignore case while completing</span>
<span class="org-builtin">set</span> completion-ignore-case on

<span class="org-comment-delimiter"># </span><span class="org-comment"># will display all alternatives for completion after one tab keypress</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">set show-all-if-ambiguous on</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">#* get Bash to display accented characters (Emacs *Meta Key* Problems in XTerm)</span>

<span class="org-comment-delimiter"># </span><span class="org-comment"># don't strip characters to 7 bits when reading</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">set input-meta on</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># (synonym of 'meta-flag')</span>

<span class="org-comment-delimiter"># </span><span class="org-comment"># display characters with the eighth bit set directly rather than as</span>
<span class="org-comment-delimiter"># </span><span class="org-comment"># meta-prefixed characters</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">set output-meta on</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">.inputrc ends here</span>
</pre></div>
</div>
</div>
<div id="outline-container-orgheadline53" class="outline-2">
<h2 id="orgheadline53"><span class="section-number-2">8</span> Install environment</h2>
<div class="outline-text-2" id="text-8">
<p>Symlink the files.</p>
<div class="org-src-container">
<pre class="src src-shell">
ln -f -s $(<span class="org-builtin">pwd</span>)/../src/.bashrc        ~/.bashrc
ln -f -s $(<span class="org-builtin">pwd</span>)/../src/.bash_profile  ~/.bash_profile
ln -f -s $(<span class="org-builtin">pwd</span>)/../src/.commonshrc    ~/.commonshrc
ln -f -s $(<span class="org-builtin">pwd</span>)/../src/.inputrc       ~/.inputrc
ln -f -s $(<span class="org-builtin">pwd</span>)/../src/.zshrc         ~/.zshrc
</pre></div>
<p>Or something like…</p>
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-keyword">if</span> [ -d <span class="org-string">"$HOME/src/shellrc/src"</span> ]
<span class="org-keyword">then</span>
    <span class="org-variable-name">PATH</span>=<span class="org-string">"$HOME/src/shellrc/src:$PATH"</span>
<span class="org-keyword">fi</span>
</pre></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
